[
    {
        "title": "UK-France migrant returns deal comes into force",
        "description": "Sir Keir Starmer and Emmanuel Macron's migrant deal comes into force today, with detentions set to begin by the end of the week.",
        "url": "https://news.sky.com/story/uk-france-migrant-returns-deal-comes-into-force-13407017",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-migrants-dunkirk-france_6939149.jpg?20250611113643",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-04 17:37:00",
        "Headline": "The pilot agreement, which was announced during Emmanuel Macron's state visit to the UK last month, will see some people who have crossed the Channel sent back to France in exchange for taking some asylum seekers with ties to Britain. ",
        "Content": " Sir Keir Starmer and Emmanuel Macron's migrant deal comes into force today, with detentions set to begin by the end of the week. The \"one in, one out\" pilot scheme - which allows the UK to send some people who have crossed the Channel back to France in exchange for asylum seekers with ties to Britain - was signed last week, and has now been approved by the European Commission. Politics Hub: Follow live updates It comes as 2025 is on course to be a record year for crossings. Approximately 25,436 people have already made the journey this year, according to PA news agency analysis of Home Office figures - 49% higher than at the same point in 2024. The prime minister and the French president hailed the deal as a \"good agreement\" when it was first announced during the latter's visit to the UK last month. The scheme also means that anyone arriving in a small boat can be detained immediately, with space set aside at immigration removal centres in anticipation of their arrival. Sir Keir said the ratification of the treaty will \"send a clear message - if you come here illegally on a small boat you will face being sent back to France\". Ministers have so far declined to say how many people could be returned under the deal, however, there have been reports that under the scheme only 50 people a week will be returned to France. Sky News political correspondent Rob Powell said while it was a \"policy win\" for the government, the numbers must eventually get higher than 50 per week if it is to work as a deterrent. Powell said the aim will be to make asylum seekers believe the \"risk of going back to France is so big that they shouldn't bother parting with their cash and paying smugglers\" to make the crossing. Read more:What is the UK-France migrant returns deal?Clampdown on social media ads for Channel crossings unveiled The Conservatives have branded the agreement a \"surrender deal\" and said it will make \"no difference whatsoever\". Under the terms of the agreement, adults arriving on small boats will face being returned to France if their asylum claim is inadmissible. In exchange, the same number of people will be able to come to the UK on a new legal route, provided they have not attempted a crossing before and subject to stringent documentation and security checks. The pilot scheme is set to run until June 2026, pending a longer-term agreement. Home Secretary Yvette Cooper will face questions on the agreement on Sky News Breakfast this morning."
    },
    {
        "title": "Police warn of mass arrests if Palestine Action protest goes ahead",
        "description": "Police are warning of mass arrests if a protest in support of the banned group Palestine Action goes ahead on Saturday.",
        "url": "https://news.sky.com/story/police-warn-of-mass-arrests-if-planned-protest-goes-ahead-13407087",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-london-protest_6963657.jpg?20250712200416",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-04 22:43:00",
        "Headline": "Palestine Action's ban under terrorism legislation passed comfortably through the Commons but has provoked anger among pro-Gaza MPs and campaigners. The proscription places the group alongside the likes of Hezbollah and Islamic State.",
        "Content": "Police are warning of mass arrests if a protest in support of the banned group Palestine Action goes ahead on Saturday. Hundreds of people are expected to turn out for the demonstration, which is understood to be planned for London. However, the Metropolitan Police said \"anyone showing support for the group can expect to be arrested.\" \"We are aware that the organisers of Saturday's planned protest are encouraging hundreds of people to turn out with the intention of placing a strain on the police and the wider criminal justice system,\" said a spokesperson. The organisers, a pressure group called Defend Our Juries, denied their protest will try to overwhelm the police and justice system. \"If we are allowed to protest peacefully and freely, then that is no bother to anyone,\" said the group in a statement.  Palestine Action was banned under terrorism laws after two aircraft were damaged at RAF Brize Norton on 20 June. Home Secretary Yvette Cooper said the vandalism of the planes was \"disgraceful\" and accused the group of a \"long history of unacceptable criminal damage\". The ban means membership of, or support for, Palestine Action is a criminal offence punishable by up to 14 years in prison. More than 200 people supporting the group were arrested at Defend Our Juries protests across the UK last month, many of whom held placards with the message: \"I oppose genocide, I support Palestine Action.\" Downing Street has urged people not to attend this weekend's protest. Read more on Sky News:Kremlin urges nuclear cautionHow Euros star juggled studies and training It comes after around 40 people gathered outside Labour HQ on Monday to protest the party's stance on Gaza. They were watched by a small group of police officers as they chanted phrases including: \"Shame on Keir Starmer, shame on the Labour Party, shame on David Lammy.\" Separately, the Board of Deputies of British Jews has also confirmed it will protest this weekend, with community organisations marching through central London to Downing Street on Sunday. They are calling for the government not to recognise the state of Palestine without all hostages taken by Hamas being released. Last week, Sir Keir Starmer said he planned to recognise Palestine by the UN General Assembly meeting in September, unless Israel met certain conditions including agreeing a ceasefire and improving the humanitarian situation in Gaza."
    },
    {
        "title": "Permission granted for first-of-its-kind British rocket launch",
        "description": "Permission for the first vertical space launch from UK soil by a British rocket company has been granted by the air safety regulator.",
        "url": "https://news.sky.com/story/permission-granted-for-first-of-its-kind-british-rocket-launch-13407089",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-skyrora-rocket_6983035.jpg?20250805005431",
        "type": "Home",
        "Author": "Tom Clarke",
        "Date Published": "2025-08-04 23:24:00",
        "Headline": "Although the newly-granted licence allows up to 16 launches a year, the Shetland's spaceport isn't expected to be able to facilitate a launch until early 2026.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n Permission for the first vertical space launch from UK soil by a British rocket company has been granted by the air safety regulator. The licence from the Civil Aviation Authority (CAA) gives Glasgow-based Skyrora the green light to launch its Skylark L rocket from the SaxaVord Spaceport in the Shetland Islands. \"Skyrora is proud to be leading efforts that enable launch activity from the UK, and we look forward to achieving a reliable commercial launch programme that benefits us all,\" said Volodymyr Levykin, CEO of Skyrora. \"It is essential that the UK has sovereign launch capabilities.\" While it's a step towards that goal, the licence doesn't mean the Shetlands will rival America's Cape Canaveral any time soon. Although the CAA licence allows Skyrora up to 16 launches a year, SaxaVord isn't expected to be able to facilitate a launch until early 2026. The current licence is also limited to sub-orbital launches of the 11m tall rocket. Skyrora expects its rocket to reach an altitude of between 120 and 130km - well over the 100km-high \"Karman Line\", which is the internationally-agreed boundary of space. But Skylark L lacks the heft to access low-earth orbit, the ultimate goal for the emerging \"micro launch\" industry. 'Important milestone' Like many of its competitors, Skyrora is using this smaller rocket to test various technologies - and the regulatory environment - before attempting an orbital flight with its larger vehicle, Skyrora-XL. Launching from northern latitudes like the UK offers easier access to satellites in polar or sun-synchronous orbits. Smaller rockets potentially mean cheaper and faster launches, offering a \"responsive\" launch capability to service or support the increasing number of satellites in orbit. \"I am thrilled we've reached this important milestone in the UK space sector, and I congratulate Skyrora for being the first UK company to receive a rocket launch licence,\" said aviation and space minister Mike Kane. The UK, however, has been criticised for being slow to develop a domestic space capability since the Space Industry Act made it possible back in 2018. The first licence for a UK space launch wasn't granted until 2022, but the attempt by Richard Branson's Virgin Galactic for a horizontal rocket launch from an aircraft failed. Read more on Sky News:Hunt for smugglers fuelling meth explosionSky reporter returns to scene of riots confrontation Another licence was granted earlier this year to German micro-launch company RFA but an explosion during testing of their rocket at SaxaVord delayed its plans for a suborbital launch this year. Modifications being made to the SaxaVord spaceport mean it may not be ready to accommodate a launch until 2026. Skyrora told Sky News that if there are significant delays to its plans to launch from SaxaVord, it may look into transferring its CAA licence to Australia's regulator. If so, it expects it could launch SkylarkL from Australia's Woomera test range before the end of 2025. No doubt that would be a disappointment for the UK government and thousands of space enthusiasts in the UK, but it would see history repeat itself. The first (and last) British-built rocket to put a satellite into orbit, Black Arrow, launched from Woomera in 1971."
    },
    {
        "title": "Prison system came 'within days of collapse' - and not just once",
        "description": "The prison system was close to collapse on a number of occasions between autumn 2023 and summer 2024, an independent review by former chief inspector of prisons, Dame Anne Owers, has found.",
        "url": "https://news.sky.com/story/prison-system-came-within-days-of-collapse-and-not-just-once-13406971",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-pentonville-prison_6826287.jpg?20250212080857",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-04 16:19:00",
        "Headline": "The pressure on prisons, which Sir Keir Starmer has previously blamed on the Tories, has seen the government decide to release some prisoners early. Longer term solutions include building more jails and changes to parole.",
        "Content": "The prison system was close to collapse on a number of occasions between autumn 2023 and summer 2024, an independent review by former chief inspector of prisons, Dame Anne Owers, has found. The report, which was published on Tuesday, said there was a systemic problem which has led to recurring prison capacity crises over the last 18 years. Follow live updates in the Politics Hub Dame Anne warned there is an urgent need for senior staff in the justice system to move from crisis management to a more strategic approach to avoid repeated issues. The report also stressed the importance of having enough capacity in probation and other community services, as they are critical to prevent offending and reoffending. The report, which was commissioned by Lord Chancellor Shabana Mahmood in February, also detailed the financial cost of the crisis. It found the price of holding prisoners in police cells reached over £70m, while construction costs for new prisons nearly doubled to £10.1bn. Read more from Sky News:'Bleak' prison put into special measuresPrisoners to be moved to lower security jail  Prisons struggling to 'work effectively and safely' Dame Anne said: \"The scale, likelihood, risks, and consequences of the prison capacity crisis could not have been signalled more clearly, at every level of government. \"The response was last-minute short-term fixes rather than long-term solutions to the underlying problems.\" She said the crises had spanned successive governments, and \"seriously affected prisons' ability to work effectively and safely\". Rather than just invest in prisons themselves, the government should pour more money into community provision to help reduce offending and reoffending, she added. Other recommendations include: • Putting in place a 10-year plan for capacity in probation and community services • Setting up an independent body to provide advice and check the plans of prison and probation services • Getting the HM Prison and Probation Service (HMPPS) Board to evaluate the Prison Service  'Close to total collapse' Ms Mahmood, the justice secretary, said: \"This report lays bare the disgraceful way the last Conservative government ran our prisons. \"They added less than 500 cells to the prison estate over 14 years, released over 10,000 prisoners early under a veil of secrecy, and brought our jails close to total collapse on countless occasions.\" She said the Labour government had opened 2,400 new cells since coming into office and was on track for 14,000 by 2031, and also pointed to sentencing reforms that could see some prisoners released earlier."
    },
    {
        "title": "'David and Goliath battle' as talks begin over deal to reduce plastic pollution",
        "description": "The scientist who first raised the alarm over microplastics in the world's oceans has warned of a \"David vs Goliath\" battle between scientists and the plastics industry - as delegates begin to negotiate a global deal to reduce plastic pollution.",
        "url": "https://news.sky.com/story/david-and-goliath-battle-as-talks-begin-over-deal-to-reduce-plastic-pollution-13406792",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-moore-thompson_6982670.jpg?20250804133230",
        "type": "Home",
        "Author": "Thomas Moore, science correspondent, and Shahryar Iravani, science producer",
        "Date Published": "2025-08-04 11:39:00",
        "Headline": "The UK is among the countries arguing in favour of a deal to massively reduce plastic pollution - but there are powerful nations and industry players standing in its way.",
        "Content": "By Thomas Moore, science correspondent, and Shahryar Iravani, science producer   The scientist who first raised the alarm over microplastics in the world's oceans has warned of a \"David vs Goliath\" battle between scientists and the plastics industry - as delegates begin to negotiate a global deal to reduce plastic pollution. As United Nations talks begin this week, Professor Richard Thompson, head of the International Marine Litter unit at Plymouth University, said: \"We're seeing some coercion and some pressure being put by some of those that have got conflicts of interest that fear they stand to lose from the treaty progress.\" Representatives of 175 countries will meet in Switzerland today, for what should be a final round of negotiations over a legally binding treaty to reduce plastic pollution. The United Nations says while some countries are taking action on plastic, pollution is a global problem that needs a global agreement - but there is no official scientific presence at the talks. Professor Thompson, who is attending the negotiations, said: \"We're only there as observers with a limited capacity to speak, whereas those from the industry have got a massive vested interest. They're funded to be there. And it's a bit of a David and Goliath battle.\" He continued: \"It concerns me that I see some nations that are taking an increasingly short-sighted view, a view that's perhaps driven by political cycles or short-run profits. \"You know, we need those leaders of countries, those negotiators, to take the long-term view to protect our planet for future generations.\" More than 430 million tonnes of plastic is produced each year. But according to environmental charity WWF, around 11 million tonnes end up in the ocean each year as pollution. And that's expected to rise to 29 million tonnes a year by 2040. There is wide consensus among countries that plastic pollution is a problem, but they are split over what to do about it. The UK and more than 70 other nations that are part of a \"High Ambition Coalition\" want production and consumption of plastic reduced to sustainable levels. But major oil producing nations and the chemical industry oppose any cuts. The previous round of talks, in South Korea last year, collapsed in disagreement. Professor Thompson is a founding member of the Scientists' Coalition for an Effective Plastics Treaty. 'Strong treaty' still possible He said previous negotiations have been swamped by lobbyists from the chemicals industry putting pressure on delegates - and that if a good agreement cannot be achieved, leading countries should look to work outside the United Nations framework. Professor Thompson said: \"Given that there are more than 100 nations that are already backing the level of ambition that's required, I think it could be possible to take this out of the UN process, to have a strong treaty that will function to end plastic pollution, to start with those 100 or 120 or so countries and to add others over time. \"I think there'll be a realisation for those that aren't on board initially, that if they don't join forces with that coalition of the willing, they're going to suffer in terms of their own international trade and that it's better to be part of that strong treaty than not to be.\" Plastic is so widely used because it's cheap, durable and can take many forms. So production of new plastic will only fall if better use can be made of the material that already exists. The company Project Plan B is working with the charity The Salvation Army to recycle polyester textiles. They've installed the first machine of its kind to turn the material into plastic pellets that can be used to make yarn for new clothes. Read more from Sky News:Government invests £63m in 'sustainable' jet fuelRevealed: How much rubbish found on UK beaches 'Terrible waste' Just a handful of the pellets is enough to make a T-shirt. Tim Cross, the director of Project Plan B, said the aim is to make the recycling process a closed loop, so as little as possible escapes as waste or pollution. \"This makes much better use of that plastic,\" he said. \"If we're wasting it and losing it into the environment, that's a terrible waste, and we mustn't allow that to happen.\" The UK produces around 700,000 tonnes of textile waste each year. Almost all is landfilled or incinerated. A major problem is that most clothes are made of mixed materials, which makes it uneconomical to recycle them. A polyester shirt may have nylon buttons and cotton thread. But Project Plan B has been working with school uniform maker David Luke on a blazer made completely out of polyester and 100% recyclable. \"These garments normally last on children's backs for a couple of years and used as goalposts a few times. And then what?\" said Mr Cross. \"We wanted to make sure that we can fully recycle the blazer through the system that we've got here, so we had to completely redesign it. \"This is groundbreaking, changing the way that clothing can be made. \"When you've got something that is recycled and recyclable, you've got an instant solution.\""
    },
    {
        "title": "Donald Trump wades into Sydney Sweeney ad debate",
        "description": "Donald Trump has waded into the debate surrounding Sydney Sweeney's jeans ad.",
        "url": "https://news.sky.com/story/donald-trump-wades-into-sydney-sweeney-ad-debate-13407019",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sydney-sweeney-advert_6982943.jpg?20250804195137",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-04 17:51:00",
        "Headline": "The ad featuring the 27-year-old actress has the tagline \"Sydney Sweeney has great jeans\" and sparked a debate in the US over race and Western beauty standards.",
        "Content": " Donald Trump has waded into the debate surrounding Sydney Sweeney's jeans ad. The American Eagle ad, which features the 27-year-old actress, who starred in the HBO series Euphoria and White Lotus, has the tagline \"Sydney Sweeney has great jeans\". It has sparked a debate in the US over race and Western beauty standards. In a Truth Social post, the US president described it as the \"hottest ad out there\". Hailing Sweeney as a \"registered Republican\", he said the jeans are \"flying off the shelves\", adding: \"Go get 'em Sydney!\" Most of the criticism of the ad has centred on videos using the word \"genes\" instead of \"jeans\", with one in which Sweeney says: \"Genes are passed down from parents to offspring, often determining traits like hair colour, personality and even eye colour. My jeans are blue.\" Critics argued the play on words potentially promotes eugenics, a discredited theory that believed humanity could be improved through the selective breeding of certain traits. But others have defended the ad, saying the critics are reading too much into its message. The video appeared on American Eagle's Facebook page and other social media channels, but is not part of the ad campaign. In a statement on Instagram on Friday, American Eagle Outfitters said the campaign \"is and always was about the jeans. Her jeans. Her story. We'll continue to celebrate how everyone wears their AE jeans with confidence, their way. Great jeans look good on everyone.\" Stocks in American Eagle Outfitters jumped by 23.3% after Mr Trump's intervention. Read more from Sky News:Kremlin urges caution in nuclear rhetoric following Trump's submarine orderStill wanted: UK riots suspects pictured in new police appeal US correspondent They say all publicity is good publicity, and Sydney Sweeney's American Eagle ad is certainly notching up the column inches, especially now Donald Trump has intervened. The US president must have been breathlessly excited when he found out Sweeney was a registered Republican because he wrote a Truth Social post in support of her before deleting it twice and reposting three times to correct various spelling and grammatical errors. He clearly could not wait to get involved in the discourse. \"Sydney Sweeney, a registered Republican, has the HOTTEST ad out there,” he wrote. \"Go get 'em Sydney!\" In any other era, the president weighing in so heavily on one side of a pop culture issue would've been unusual. But the current president knows people are talking about the ad around their dinner tables and at parties right now. By injecting himself into the discussion, they will now be talking about him too.  In his Truth Social post, which he reposted three times to fix various typos, Mr Trump compared the ad with \"woke\" ones \"on the other side of the ledger\" - as he criticised other companies, as well as hitting out at Taylor Swift. \"The tide has seriously turned - Being WOKE is for losers, being Republican is what you want to be,\" he wrote. Sky News has contacted Sweeney's agent for comment."
    },
    {
        "title": "Girl, 4, dies following incident at Waterworld in Stoke-on-Trent",
        "description": "A four-year-old girl has died following an incident at a swimming pool in Hanley, Stoke-on-Trent.",
        "url": "https://news.sky.com/story/girl-4-dies-following-incident-at-waterworld-in-stoke-on-trent-13407048",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-waterworld-stoke-on-trent_6982991.jpg?20250804213808",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-04 19:31:00",
        "Headline": "The girl was found unconscious and, despite the efforts of lifeguards and the emergency services, she died shortly after arriving at hospital.",
        "Content": "A four-year-old girl has died following an incident at a swimming pool in Hanley, Stoke-on-Trent. Police said they were \"called to Waterworld on Festival Way at around 4.20pm to reports of a girl, aged four, in a critical condition\". \"Waterworld staff and colleagues from the West Midlands Ambulance Service treated the girl at the scene before paramedics took her to hospital for further treatment,\" officers added. \"Despite the best efforts of hospital staff, the girl died a short while later. \"The girl's next of kin have been informed and are being supported by specially-trained officers.\" Detective Chief Inspector Lucy Maskew from Staffordshire Police said: \"Our thoughts are with the family at this terribly sad time. \"We are now making enquiries and looking to establish the circumstances of the incident. We would ask that members of the public avoid speculating in these early stages of the investigation and allow the family to grieve.\" A Waterworld spokesperson said: \"It is with great sadness that we learned of this little girl's passing this evening. \"All our thoughts are with her family and loved ones during these extremely difficult times. Waterworld is in shock and has decided to remain closed tomorrow out of respect for the family. Waterworld is working closely with the authorities at this sad time.\" In a post on Facebook, Waterworld said the fatal incident happened at 4.15pm, \"in the lagoon area of the aqua park\". The girl was \"found unconscious and treated on poolside by our lifeguard and management teams on site. Read more on Sky News:Storm Floris latest: UK hit by 124mph windsKremlin urges nuclear cautionHow Euros star juggled studies and training \"They immediately provided CPR and called the emergency services, who arrived around 4.20pm. \"All other visitors were asked to quietly leave the pool out of respect for the rescue operation underway, and we would like to thank them for their support and collaboration.\" Waterworld describes itself on its website as \"the UK's number one tropical indoor aqua park\"."
    },
    {
        "title": "Kremlin urges caution in nuclear rhetoric following Donald Trump's submarine announcement",
        "description": "The Kremlin has urged caution in nuclear rhetoric, responding for the first time to US President Donald Trump's announcement that the US is repositioning nuclear submarines.",
        "url": "https://news.sky.com/story/kremlin-urges-caution-in-nuclear-rhetoric-following-donald-trumps-submarine-announcement-13406766",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-dmitry-peskov-russia_6946454.jpg?20250620082757",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-04 10:54:00",
        "Headline": "Kremlin spokesman Dmitry Peskov said Moscow did not view Mr Trump's statement as an escalation in nuclear tension.",
        "Content": " The Kremlin has urged caution in nuclear rhetoric, responding for the first time to US President Donald Trump's announcement that the US is repositioning nuclear submarines. Kremlin spokesman Dmitry Peskov played down the significance of Mr Trump's comments, saying on Monday that US submarines are already on combat duty and that Moscow does not want to comment further. Mr Trump said last Friday that he had ordered two submarines to be moved to \"the appropriate regions\" in response to remarks from former Russian president Dmitry Medvedev about the risk of war between the nuclear-armed powers. \"In this case, it is obvious that American submarines are already on combat duty. This is an ongoing process, that's the first thing,\" Mr Peskov told reporters. \"But in general, of course, we would not want to get involved in such a controversy and would not want to comment on it in any way,\" he said. \"Of course, we believe that everyone should be very, very careful with nuclear rhetoric.\" Mr Peskov said Moscow did not view Mr Trump's statement as an escalation in nuclear tension. \"We do not believe that we are talking about any escalation now. It is clear that very complex, very sensitive issues are being discussed, which, of course, are perceived very emotionally by many people,\" he said. \n                  Inside the monastery where 'crazy medicine' addicts drink secret potion to detox\n                 \n                  'David and Goliath battle' as talks begin over deal to reduce plastic pollution\n                 \n                  Netanyahu to instruct Israeli military on next steps in Gaza after ceasefire talks collapse\n                 He declined to answer directly whether Mr Medvedev, who currently serves as deputy chairman of the Security Council of Russia, was advised to tone down his online altercation with Mr Trump. \"Listen, in every country, members of the leadership... have different points of view on events that are taking place, different attitudes. There are people who are very, very tough-minded in the United States of America and in European countries, so this is always the case,\" Mr Peskov said. \"But the main thing, of course, is the position of President (Vladimir) Putin. You know that in our country, foreign policy is formulated by the head of state, that is, President Putin.\" The spat between Mr Trump and Mr Medvedev flared up after the US president said he is reducing his 50-day deadline for Russia to end its war in Ukraine to less than two weeks. Mr Medvedev posted on social media that Mr Trump was \"playing the ultimatum game with Russia… Each new ultimatum is a threat and a step towards war\". The US president responded: \"Tell Medvedev, the failed former Russian president who thinks he is still in power, to be careful what he says. He is entering very dangerous territory.\" Medvedev's following post mentioned \"Dead Hand,\" the automatic nuclear retaliation system created during the Soviet era. Ukraine and Russia continue attacks amid stalled talks  Meanwhile, Russia and Ukraine continue exchanging strikes as peace talks to end the conflict remain stalled. Ukraine's security service said on Monday that its drones have attacked a Russian military airfield in Crimea, damaging several planes. The Ukrainian military also claimed it had attacked a Russian fuel depot at Sochi airport the previous day. Russian officials reported on Sunday that an overnight Ukrainian drone attack on an oil depot near the Black Sea resort of Sochi caused a large fire, which prompted authorities to halt flights from the airport. Ukraine said on Monday its forces neutralised 161 out of 162 Russian drones launched overnight. As the US deadline for the Russian president to agree to a ceasefire in Ukraine approaches, Mr Trump's Special Envoy Steve Wikoff will be travelling to Moscow on Wednesday for talks. Ukrainian President Volodymyr Zelensky said Sunday that Ukraine and Russia have agreed to exchange 1,200 prisoners following their latest round of negotiations in Istanbul in July. Mr Zelensky also said that his office is in communication with US partners and that \"pressure on Russia can truly work - in a way that makes them feel the consequences of prolonging the war\"."
    },
    {
        "title": "UK-France migrant returns deal comes into force",
        "description": "Sir Keir Starmer and Emmanuel Macron's migrant deal comes into force today, with detentions set to begin by the end of the week.",
        "url": "https://news.sky.com/story/uk-france-migrant-returns-deal-comes-into-force-13407017",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-migrants-dunkirk-france_6939149.jpg?20250611113643",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-04 17:37:00",
        "Headline": "The pilot agreement, which was announced during Emmanuel Macron's state visit to the UK last month, will see some people who have crossed the Channel sent back to France in exchange for taking some asylum seekers with ties to Britain. ",
        "Content": " Sir Keir Starmer and Emmanuel Macron's migrant deal comes into force today, with detentions set to begin by the end of the week. The \"one in, one out\" pilot scheme - which allows the UK to send some people who have crossed the Channel back to France in exchange for asylum seekers with ties to Britain - was signed last week, and has now been approved by the European Commission. Politics Hub: Follow live updates It comes as 2025 is on course to be a record year for crossings. Approximately 25,436 people have already made the journey this year, according to PA news agency analysis of Home Office figures - 49% higher than at the same point in 2024. The prime minister and the French president hailed the deal as a \"good agreement\" when it was first announced during the latter's visit to the UK last month. The scheme also means that anyone arriving in a small boat can be detained immediately, with space set aside at immigration removal centres in anticipation of their arrival. Sir Keir said the ratification of the treaty will \"send a clear message - if you come here illegally on a small boat you will face being sent back to France\". Ministers have so far declined to say how many people could be returned under the deal, however, there have been reports that under the scheme only 50 people a week will be returned to France. Sky News political correspondent Rob Powell said while it was a \"policy win\" for the government, the numbers must eventually get higher than 50 per week if it is to work as a deterrent. Powell said the aim will be to make asylum seekers believe the \"risk of going back to France is so big that they shouldn't bother parting with their cash and paying smugglers\" to make the crossing. Read more:What is the UK-France migrant returns deal?Clampdown on social media ads for Channel crossings unveiled The Conservatives have branded the agreement a \"surrender deal\" and said it will make \"no difference whatsoever\". Under the terms of the agreement, adults arriving on small boats will face being returned to France if their asylum claim is inadmissible. In exchange, the same number of people will be able to come to the UK on a new legal route, provided they have not attempted a crossing before and subject to stringent documentation and security checks. The pilot scheme is set to run until June 2026, pending a longer-term agreement. Home Secretary Yvette Cooper will face questions on the agreement on Sky News Breakfast this morning."
    },
    {
        "title": "Police warn of mass arrests if Palestine Action protest goes ahead",
        "description": "Police are warning of mass arrests if a protest in support of the banned group Palestine Action goes ahead on Saturday.",
        "url": "https://news.sky.com/story/police-warn-of-mass-arrests-if-planned-protest-goes-ahead-13407087",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-london-protest_6963657.jpg?20250712200416",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-04 22:43:00",
        "Headline": "Palestine Action's ban under terrorism legislation passed comfortably through the Commons but has provoked anger among pro-Gaza MPs and campaigners. The proscription places the group alongside the likes of Hezbollah and Islamic State.",
        "Content": "Police are warning of mass arrests if a protest in support of the banned group Palestine Action goes ahead on Saturday. Hundreds of people are expected to turn out for the demonstration, which is understood to be planned for London. However, the Metropolitan Police said \"anyone showing support for the group can expect to be arrested.\" \"We are aware that the organisers of Saturday's planned protest are encouraging hundreds of people to turn out with the intention of placing a strain on the police and the wider criminal justice system,\" said a spokesperson. The organisers, a pressure group called Defend Our Juries, denied their protest will try to overwhelm the police and justice system. \"If we are allowed to protest peacefully and freely, then that is no bother to anyone,\" said the group in a statement.  Palestine Action was banned under terrorism laws after two aircraft were damaged at RAF Brize Norton on 20 June. Home Secretary Yvette Cooper said the vandalism of the planes was \"disgraceful\" and accused the group of a \"long history of unacceptable criminal damage\". The ban means membership of, or support for, Palestine Action is a criminal offence punishable by up to 14 years in prison. More than 200 people supporting the group were arrested at Defend Our Juries protests across the UK last month, many of whom held placards with the message: \"I oppose genocide, I support Palestine Action.\" Downing Street has urged people not to attend this weekend's protest. Read more on Sky News:Kremlin urges nuclear cautionHow Euros star juggled studies and training It comes after around 40 people gathered outside Labour HQ on Monday to protest the party's stance on Gaza. They were watched by a small group of police officers as they chanted phrases including: \"Shame on Keir Starmer, shame on the Labour Party, shame on David Lammy.\" Separately, the Board of Deputies of British Jews has also confirmed it will protest this weekend, with community organisations marching through central London to Downing Street on Sunday. They are calling for the government not to recognise the state of Palestine without all hostages taken by Hamas being released. Last week, Sir Keir Starmer said he planned to recognise Palestine by the UN General Assembly meeting in September, unless Israel met certain conditions including agreeing a ceasefire and improving the humanitarian situation in Gaza."
    },
    {
        "title": "Permission granted for first-of-its-kind British rocket launch",
        "description": "Permission for the first vertical space launch from UK soil by a British rocket company has been granted by the air safety regulator.",
        "url": "https://news.sky.com/story/permission-granted-for-first-of-its-kind-british-rocket-launch-13407089",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-skyrora-rocket_6983035.jpg?20250805005431",
        "type": "UK",
        "Author": "Tom Clarke",
        "Date Published": "2025-08-04 23:24:00",
        "Headline": "Although the newly-granted licence allows up to 16 launches a year, the Shetland's spaceport isn't expected to be able to facilitate a launch until early 2026.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n Permission for the first vertical space launch from UK soil by a British rocket company has been granted by the air safety regulator. The licence from the Civil Aviation Authority (CAA) gives Glasgow-based Skyrora the green light to launch its Skylark L rocket from the SaxaVord Spaceport in the Shetland Islands. \"Skyrora is proud to be leading efforts that enable launch activity from the UK, and we look forward to achieving a reliable commercial launch programme that benefits us all,\" said Volodymyr Levykin, CEO of Skyrora. \"It is essential that the UK has sovereign launch capabilities.\" While it's a step towards that goal, the licence doesn't mean the Shetlands will rival America's Cape Canaveral any time soon. Although the CAA licence allows Skyrora up to 16 launches a year, SaxaVord isn't expected to be able to facilitate a launch until early 2026. The current licence is also limited to sub-orbital launches of the 11m tall rocket. Skyrora expects its rocket to reach an altitude of between 120 and 130km - well over the 100km-high \"Karman Line\", which is the internationally-agreed boundary of space. But Skylark L lacks the heft to access low-earth orbit, the ultimate goal for the emerging \"micro launch\" industry. 'Important milestone' Like many of its competitors, Skyrora is using this smaller rocket to test various technologies - and the regulatory environment - before attempting an orbital flight with its larger vehicle, Skyrora-XL. Launching from northern latitudes like the UK offers easier access to satellites in polar or sun-synchronous orbits. Smaller rockets potentially mean cheaper and faster launches, offering a \"responsive\" launch capability to service or support the increasing number of satellites in orbit. \"I am thrilled we've reached this important milestone in the UK space sector, and I congratulate Skyrora for being the first UK company to receive a rocket launch licence,\" said aviation and space minister Mike Kane. The UK, however, has been criticised for being slow to develop a domestic space capability since the Space Industry Act made it possible back in 2018. The first licence for a UK space launch wasn't granted until 2022, but the attempt by Richard Branson's Virgin Galactic for a horizontal rocket launch from an aircraft failed. Read more on Sky News:Hunt for smugglers fuelling meth explosionSky reporter returns to scene of riots confrontation Another licence was granted earlier this year to German micro-launch company RFA but an explosion during testing of their rocket at SaxaVord delayed its plans for a suborbital launch this year. Modifications being made to the SaxaVord spaceport mean it may not be ready to accommodate a launch until 2026. Skyrora told Sky News that if there are significant delays to its plans to launch from SaxaVord, it may look into transferring its CAA licence to Australia's regulator. If so, it expects it could launch SkylarkL from Australia's Woomera test range before the end of 2025. No doubt that would be a disappointment for the UK government and thousands of space enthusiasts in the UK, but it would see history repeat itself. The first (and last) British-built rocket to put a satellite into orbit, Black Arrow, launched from Woomera in 1971."
    },
    {
        "title": "Prison system came 'within days of collapse' - and not just once",
        "description": "The prison system was close to collapse on a number of occasions between autumn 2023 and summer 2024, an independent review by former chief inspector of prisons, Dame Anne Owers, has found.",
        "url": "https://news.sky.com/story/prison-system-came-within-days-of-collapse-and-not-just-once-13406971",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-pentonville-prison_6826287.jpg?20250212080857",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-04 16:19:00",
        "Headline": "The pressure on prisons, which Sir Keir Starmer has previously blamed on the Tories, has seen the government decide to release some prisoners early. Longer term solutions include building more jails and changes to parole.",
        "Content": "The prison system was close to collapse on a number of occasions between autumn 2023 and summer 2024, an independent review by former chief inspector of prisons, Dame Anne Owers, has found. The report, which was published on Tuesday, said there was a systemic problem which has led to recurring prison capacity crises over the last 18 years. Follow live updates in the Politics Hub Dame Anne warned there is an urgent need for senior staff in the justice system to move from crisis management to a more strategic approach to avoid repeated issues. The report also stressed the importance of having enough capacity in probation and other community services, as they are critical to prevent offending and reoffending. The report, which was commissioned by Lord Chancellor Shabana Mahmood in February, also detailed the financial cost of the crisis. It found the price of holding prisoners in police cells reached over £70m, while construction costs for new prisons nearly doubled to £10.1bn. Read more from Sky News:'Bleak' prison put into special measuresPrisoners to be moved to lower security jail  Prisons struggling to 'work effectively and safely' Dame Anne said: \"The scale, likelihood, risks, and consequences of the prison capacity crisis could not have been signalled more clearly, at every level of government. \"The response was last-minute short-term fixes rather than long-term solutions to the underlying problems.\" She said the crises had spanned successive governments, and \"seriously affected prisons' ability to work effectively and safely\". Rather than just invest in prisons themselves, the government should pour more money into community provision to help reduce offending and reoffending, she added. Other recommendations include: • Putting in place a 10-year plan for capacity in probation and community services • Setting up an independent body to provide advice and check the plans of prison and probation services • Getting the HM Prison and Probation Service (HMPPS) Board to evaluate the Prison Service  'Close to total collapse' Ms Mahmood, the justice secretary, said: \"This report lays bare the disgraceful way the last Conservative government ran our prisons. \"They added less than 500 cells to the prison estate over 14 years, released over 10,000 prisoners early under a veil of secrecy, and brought our jails close to total collapse on countless occasions.\" She said the Labour government had opened 2,400 new cells since coming into office and was on track for 14,000 by 2031, and also pointed to sentencing reforms that could see some prisoners released earlier."
    },
    {
        "title": "Girl, 4, dies following incident at Waterworld in Stoke-on-Trent",
        "description": "A four-year-old girl has died following an incident at a swimming pool in Hanley, Stoke-on-Trent.",
        "url": "https://news.sky.com/story/girl-4-dies-following-incident-at-waterworld-in-stoke-on-trent-13407048",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-waterworld-stoke-on-trent_6982991.jpg?20250804213808",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-04 19:31:00",
        "Headline": "The girl was found unconscious and, despite the efforts of lifeguards and the emergency services, she died shortly after arriving at hospital.",
        "Content": "A four-year-old girl has died following an incident at a swimming pool in Hanley, Stoke-on-Trent. Police said they were \"called to Waterworld on Festival Way at around 4.20pm to reports of a girl, aged four, in a critical condition\". \"Waterworld staff and colleagues from the West Midlands Ambulance Service treated the girl at the scene before paramedics took her to hospital for further treatment,\" officers added. \"Despite the best efforts of hospital staff, the girl died a short while later. \"The girl's next of kin have been informed and are being supported by specially-trained officers.\" Detective Chief Inspector Lucy Maskew from Staffordshire Police said: \"Our thoughts are with the family at this terribly sad time. \"We are now making enquiries and looking to establish the circumstances of the incident. We would ask that members of the public avoid speculating in these early stages of the investigation and allow the family to grieve.\" A Waterworld spokesperson said: \"It is with great sadness that we learned of this little girl's passing this evening. \"All our thoughts are with her family and loved ones during these extremely difficult times. Waterworld is in shock and has decided to remain closed tomorrow out of respect for the family. Waterworld is working closely with the authorities at this sad time.\" In a post on Facebook, Waterworld said the fatal incident happened at 4.15pm, \"in the lagoon area of the aqua park\". The girl was \"found unconscious and treated on poolside by our lifeguard and management teams on site. Read more on Sky News:Storm Floris latest: UK hit by 124mph windsKremlin urges nuclear cautionHow Euros star juggled studies and training \"They immediately provided CPR and called the emergency services, who arrived around 4.20pm. \"All other visitors were asked to quietly leave the pool out of respect for the rescue operation underway, and we would like to thank them for their support and collaboration.\" Waterworld describes itself on its website as \"the UK's number one tropical indoor aqua park\"."
    },
    {
        "title": "Storm Floris: Travellers warned to expect more disruption",
        "description": "Travellers have been warned to expect disruption to trains in Scotland today as the country continues to feel the effects of Storm Floris.",
        "url": "https://news.sky.com/story/storm-floris-travellers-warned-to-expect-more-disruption-13407086",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-scotland-onich-storm-flori_6982721.jpg?20250804141832",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-04 22:30:00",
        "Headline": "Staff worked through the night to clear tracks blocked by fallen trees and debris after \"significant disruption\" on Monday, when winds of up to 124mph affected roads, flights, ferries and left thousands without power.",
        "Content": " Travellers have been warned to expect disruption to trains in Scotland today as the country continues to feel the effects of Storm Floris. Services are likely to be affected as the storm - which brought winds of up to 124mph on Monday, bringing down trees and power lines, closing roads and cancelling flights - blows through. Storm Floris as it happened The Scottish government held an emergency meeting last night to discuss the \"significant disruption\" caused and the efforts under way to recover, as rail operators look to clear routes covered by debris and utilities firms work to reconnect properties experiencing power outages. Ross Moran, Network Rail Scotland's route director, said teams had been \"working tirelessly to keep services moving where possible and to clear fallen trees and debris from the tracks\". By the evening, their focus had switched to \"inspecting routes which have been closed by fallen trees, debris and other damage\", and work will continue into today. \"We're grateful to passengers for their patience whilst we do this,\" Mr Moran added. Most weather warnings have expired, but a yellow warning for wind is in place until 8am over the Shetland Islands and Orkney, and showers will remain throughout the rest of Scotland. Rail, road, and ferry travel was disrupted by the storm on Monday, as 100 Edinburgh Fringe events were cancelled, according to organisers. At one point, more than 30,000 people were without power. At least 68 flights were cancelled, aviation analytics firm Cirium said, with Aberdeen and Belfast City the worst-affected airports. Western coastal areas bore the brunt of the storm, but strong winds and heavy rain affected much of the rest of the country. Police received \"multiple reports\" of camper vans blown over on the A87 between Broadford and Portree on Skye, while in Aberdeenshire the A96 was closed in both directions near Old Rayne because of fallen trees. Fallen trees have also seen a number of other roads closed, including the A95 Rosarie road in both directions, while the A9 at Daviot was partially blocked by a fallen tree and the A1 Tyne Bridge was only open to cars and single-decker buses. Read more on Sky News:First female MI5 chief diesGirl, 4, dies at water parkHow Euros star juggled studies and training  Those driving in poor weather have been urged to avoid the worst-hit areas and slow down when on the roads while allowing time for delays. Ferries have also seen widespread disruption, with ferry operator CalMac cancelling a number of sailings because of high winds. Monday's top wind speed was 124mph at Cairngorm, a mountain range in northern Scotland, according to Met Office data. Sky News weather producer Christopher England said Tuesday would be a \"much calmer\", though still windy - see your local forecast here."
    },
    {
        "title": "'David and Goliath battle' as talks begin over deal to reduce plastic pollution",
        "description": "The scientist who first raised the alarm over microplastics in the world's oceans has warned of a \"David vs Goliath\" battle between scientists and the plastics industry - as delegates begin to negotiate a global deal to reduce plastic pollution.",
        "url": "https://news.sky.com/story/david-and-goliath-battle-as-talks-begin-over-deal-to-reduce-plastic-pollution-13406792",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-moore-thompson_6982670.jpg?20250804133230",
        "type": "UK",
        "Author": "Thomas Moore, science correspondent, and Shahryar Iravani, science producer",
        "Date Published": "2025-08-04 11:39:00",
        "Headline": "The UK is among the countries arguing in favour of a deal to massively reduce plastic pollution - but there are powerful nations and industry players standing in its way.",
        "Content": "By Thomas Moore, science correspondent, and Shahryar Iravani, science producer   The scientist who first raised the alarm over microplastics in the world's oceans has warned of a \"David vs Goliath\" battle between scientists and the plastics industry - as delegates begin to negotiate a global deal to reduce plastic pollution. As United Nations talks begin this week, Professor Richard Thompson, head of the International Marine Litter unit at Plymouth University, said: \"We're seeing some coercion and some pressure being put by some of those that have got conflicts of interest that fear they stand to lose from the treaty progress.\" Representatives of 175 countries will meet in Switzerland today, for what should be a final round of negotiations over a legally binding treaty to reduce plastic pollution. The United Nations says while some countries are taking action on plastic, pollution is a global problem that needs a global agreement - but there is no official scientific presence at the talks. Professor Thompson, who is attending the negotiations, said: \"We're only there as observers with a limited capacity to speak, whereas those from the industry have got a massive vested interest. They're funded to be there. And it's a bit of a David and Goliath battle.\" He continued: \"It concerns me that I see some nations that are taking an increasingly short-sighted view, a view that's perhaps driven by political cycles or short-run profits. \"You know, we need those leaders of countries, those negotiators, to take the long-term view to protect our planet for future generations.\" More than 430 million tonnes of plastic is produced each year. But according to environmental charity WWF, around 11 million tonnes end up in the ocean each year as pollution. And that's expected to rise to 29 million tonnes a year by 2040. There is wide consensus among countries that plastic pollution is a problem, but they are split over what to do about it. The UK and more than 70 other nations that are part of a \"High Ambition Coalition\" want production and consumption of plastic reduced to sustainable levels. But major oil producing nations and the chemical industry oppose any cuts. The previous round of talks, in South Korea last year, collapsed in disagreement. Professor Thompson is a founding member of the Scientists' Coalition for an Effective Plastics Treaty. 'Strong treaty' still possible He said previous negotiations have been swamped by lobbyists from the chemicals industry putting pressure on delegates - and that if a good agreement cannot be achieved, leading countries should look to work outside the United Nations framework. Professor Thompson said: \"Given that there are more than 100 nations that are already backing the level of ambition that's required, I think it could be possible to take this out of the UN process, to have a strong treaty that will function to end plastic pollution, to start with those 100 or 120 or so countries and to add others over time. \"I think there'll be a realisation for those that aren't on board initially, that if they don't join forces with that coalition of the willing, they're going to suffer in terms of their own international trade and that it's better to be part of that strong treaty than not to be.\" Plastic is so widely used because it's cheap, durable and can take many forms. So production of new plastic will only fall if better use can be made of the material that already exists. The company Project Plan B is working with the charity The Salvation Army to recycle polyester textiles. They've installed the first machine of its kind to turn the material into plastic pellets that can be used to make yarn for new clothes. Read more from Sky News:Government invests £63m in 'sustainable' jet fuelRevealed: How much rubbish found on UK beaches 'Terrible waste' Just a handful of the pellets is enough to make a T-shirt. Tim Cross, the director of Project Plan B, said the aim is to make the recycling process a closed loop, so as little as possible escapes as waste or pollution. \"This makes much better use of that plastic,\" he said. \"If we're wasting it and losing it into the environment, that's a terrible waste, and we mustn't allow that to happen.\" The UK produces around 700,000 tonnes of textile waste each year. Almost all is landfilled or incinerated. A major problem is that most clothes are made of mixed materials, which makes it uneconomical to recycle them. A polyester shirt may have nylon buttons and cotton thread. But Project Plan B has been working with school uniform maker David Luke on a blazer made completely out of polyester and 100% recyclable. \"These garments normally last on children's backs for a couple of years and used as goalposts a few times. And then what?\" said Mr Cross. \"We wanted to make sure that we can fully recycle the blazer through the system that we've got here, so we had to completely redesign it. \"This is groundbreaking, changing the way that clothing can be made. \"When you've got something that is recycled and recyclable, you've got an instant solution.\""
    },
    {
        "title": "Search for British woman who disappeared from Greek beach",
        "description": "A search is under way for a British woman who went missing from a beach in Kavala, northern Greece.",
        "url": "https://news.sky.com/story/search-for-british-woman-who-disappeared-from-greek-beach-13406722",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-michele-ann-joy-bourda_6982537.jpg?20250804113256",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-04 10:08:00",
        "Headline": "The Hellenic Coastguard said the port authority received reports that Michele Ann Joy Bourda, 59, was missing, on the evening of 1 August.",
        "Content": "A search is under way for a British woman who went missing from a beach in Kavala, northern Greece. The Hellenic Coastguard said the port authority received reports that Michele Ann Joy Bourda, 59, was missing on the evening of 1 August. The woman went missing from the Ofrynio beach area. The coastguard is investigating reports that her belongings were left on the beach. On Sunday, three recreational craft, five fishing boats and two patrol boats were involved in the search. According to local media, she lived with her husband, who is reportedly of Greek origin, in the Macedonian city of Serres. She had gone to the beach with him and reportedly vanished while he was sleeping on a sunbed. \n                  Firefighters tackle blazes as wildfires break out in Greece, Turkey and Albania\n                 \n                  'Covert' and 'accelerating campaign' to return Elgin Marbles to Greece, say campaigners\n                 \n                  Wildfires break out in Turkey, Syria and Greece - with towns near Athens evacuated\n                 The charity LifeLine Hellas, which put out an appeal to try and find Ms Bourda, said she went missing at noon on 1 August. She has been described as having straight blonde hair up to her shoulders and being 1.73m tall."
    },
    {
        "title": "'David and Goliath battle' as talks begin over deal to reduce plastic pollution",
        "description": "The scientist who first raised the alarm over microplastics in the world's oceans has warned of a \"David vs Goliath\" battle between scientists and the plastics industry - as delegates begin to negotiate a global deal to reduce plastic pollution.",
        "url": "https://news.sky.com/story/david-and-goliath-battle-as-talks-begin-over-deal-to-reduce-plastic-pollution-13406792",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-moore-thompson_6982670.jpg?20250804133230",
        "type": "World",
        "Author": "Thomas Moore, science correspondent, and Shahryar Iravani, science producer",
        "Date Published": "2025-08-04 11:39:00",
        "Headline": "The UK is among the countries arguing in favour of a deal to massively reduce plastic pollution - but there are powerful nations and industry players standing in its way.",
        "Content": "By Thomas Moore, science correspondent, and Shahryar Iravani, science producer   The scientist who first raised the alarm over microplastics in the world's oceans has warned of a \"David vs Goliath\" battle between scientists and the plastics industry - as delegates begin to negotiate a global deal to reduce plastic pollution. As United Nations talks begin this week, Professor Richard Thompson, head of the International Marine Litter unit at Plymouth University, said: \"We're seeing some coercion and some pressure being put by some of those that have got conflicts of interest that fear they stand to lose from the treaty progress.\" Representatives of 175 countries will meet in Switzerland today, for what should be a final round of negotiations over a legally binding treaty to reduce plastic pollution. The United Nations says while some countries are taking action on plastic, pollution is a global problem that needs a global agreement - but there is no official scientific presence at the talks. Professor Thompson, who is attending the negotiations, said: \"We're only there as observers with a limited capacity to speak, whereas those from the industry have got a massive vested interest. They're funded to be there. And it's a bit of a David and Goliath battle.\" He continued: \"It concerns me that I see some nations that are taking an increasingly short-sighted view, a view that's perhaps driven by political cycles or short-run profits. \"You know, we need those leaders of countries, those negotiators, to take the long-term view to protect our planet for future generations.\" More than 430 million tonnes of plastic is produced each year. But according to environmental charity WWF, around 11 million tonnes end up in the ocean each year as pollution. And that's expected to rise to 29 million tonnes a year by 2040. There is wide consensus among countries that plastic pollution is a problem, but they are split over what to do about it. The UK and more than 70 other nations that are part of a \"High Ambition Coalition\" want production and consumption of plastic reduced to sustainable levels. But major oil producing nations and the chemical industry oppose any cuts. The previous round of talks, in South Korea last year, collapsed in disagreement. Professor Thompson is a founding member of the Scientists' Coalition for an Effective Plastics Treaty. 'Strong treaty' still possible He said previous negotiations have been swamped by lobbyists from the chemicals industry putting pressure on delegates - and that if a good agreement cannot be achieved, leading countries should look to work outside the United Nations framework. Professor Thompson said: \"Given that there are more than 100 nations that are already backing the level of ambition that's required, I think it could be possible to take this out of the UN process, to have a strong treaty that will function to end plastic pollution, to start with those 100 or 120 or so countries and to add others over time. \"I think there'll be a realisation for those that aren't on board initially, that if they don't join forces with that coalition of the willing, they're going to suffer in terms of their own international trade and that it's better to be part of that strong treaty than not to be.\" Plastic is so widely used because it's cheap, durable and can take many forms. So production of new plastic will only fall if better use can be made of the material that already exists. The company Project Plan B is working with the charity The Salvation Army to recycle polyester textiles. They've installed the first machine of its kind to turn the material into plastic pellets that can be used to make yarn for new clothes. Read more from Sky News:Government invests £63m in 'sustainable' jet fuelRevealed: How much rubbish found on UK beaches 'Terrible waste' Just a handful of the pellets is enough to make a T-shirt. Tim Cross, the director of Project Plan B, said the aim is to make the recycling process a closed loop, so as little as possible escapes as waste or pollution. \"This makes much better use of that plastic,\" he said. \"If we're wasting it and losing it into the environment, that's a terrible waste, and we mustn't allow that to happen.\" The UK produces around 700,000 tonnes of textile waste each year. Almost all is landfilled or incinerated. A major problem is that most clothes are made of mixed materials, which makes it uneconomical to recycle them. A polyester shirt may have nylon buttons and cotton thread. But Project Plan B has been working with school uniform maker David Luke on a blazer made completely out of polyester and 100% recyclable. \"These garments normally last on children's backs for a couple of years and used as goalposts a few times. And then what?\" said Mr Cross. \"We wanted to make sure that we can fully recycle the blazer through the system that we've got here, so we had to completely redesign it. \"This is groundbreaking, changing the way that clothing can be made. \"When you've got something that is recycled and recyclable, you've got an instant solution.\""
    },
    {
        "title": "Kremlin urges caution in nuclear rhetoric following Donald Trump's submarine announcement",
        "description": "The Kremlin has urged caution in nuclear rhetoric, responding for the first time to US President Donald Trump's announcement that the US is repositioning nuclear submarines.",
        "url": "https://news.sky.com/story/kremlin-urges-caution-in-nuclear-rhetoric-following-donald-trumps-submarine-announcement-13406766",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-dmitry-peskov-russia_6946454.jpg?20250620082757",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-04 10:54:00",
        "Headline": "Kremlin spokesman Dmitry Peskov said Moscow did not view Mr Trump's statement as an escalation in nuclear tension.",
        "Content": " The Kremlin has urged caution in nuclear rhetoric, responding for the first time to US President Donald Trump's announcement that the US is repositioning nuclear submarines. Kremlin spokesman Dmitry Peskov played down the significance of Mr Trump's comments, saying on Monday that US submarines are already on combat duty and that Moscow does not want to comment further. Mr Trump said last Friday that he had ordered two submarines to be moved to \"the appropriate regions\" in response to remarks from former Russian president Dmitry Medvedev about the risk of war between the nuclear-armed powers. \"In this case, it is obvious that American submarines are already on combat duty. This is an ongoing process, that's the first thing,\" Mr Peskov told reporters. \"But in general, of course, we would not want to get involved in such a controversy and would not want to comment on it in any way,\" he said. \"Of course, we believe that everyone should be very, very careful with nuclear rhetoric.\" Mr Peskov said Moscow did not view Mr Trump's statement as an escalation in nuclear tension. \"We do not believe that we are talking about any escalation now. It is clear that very complex, very sensitive issues are being discussed, which, of course, are perceived very emotionally by many people,\" he said. \n                  Inside the monastery where 'crazy medicine' addicts drink secret potion to detox\n                 \n                  'David and Goliath battle' as talks begin over deal to reduce plastic pollution\n                 \n                  Netanyahu to instruct Israeli military on next steps in Gaza after ceasefire talks collapse\n                 He declined to answer directly whether Mr Medvedev, who currently serves as deputy chairman of the Security Council of Russia, was advised to tone down his online altercation with Mr Trump. \"Listen, in every country, members of the leadership... have different points of view on events that are taking place, different attitudes. There are people who are very, very tough-minded in the United States of America and in European countries, so this is always the case,\" Mr Peskov said. \"But the main thing, of course, is the position of President (Vladimir) Putin. You know that in our country, foreign policy is formulated by the head of state, that is, President Putin.\" The spat between Mr Trump and Mr Medvedev flared up after the US president said he is reducing his 50-day deadline for Russia to end its war in Ukraine to less than two weeks. Mr Medvedev posted on social media that Mr Trump was \"playing the ultimatum game with Russia… Each new ultimatum is a threat and a step towards war\". The US president responded: \"Tell Medvedev, the failed former Russian president who thinks he is still in power, to be careful what he says. He is entering very dangerous territory.\" Medvedev's following post mentioned \"Dead Hand,\" the automatic nuclear retaliation system created during the Soviet era. Ukraine and Russia continue attacks amid stalled talks  Meanwhile, Russia and Ukraine continue exchanging strikes as peace talks to end the conflict remain stalled. Ukraine's security service said on Monday that its drones have attacked a Russian military airfield in Crimea, damaging several planes. The Ukrainian military also claimed it had attacked a Russian fuel depot at Sochi airport the previous day. Russian officials reported on Sunday that an overnight Ukrainian drone attack on an oil depot near the Black Sea resort of Sochi caused a large fire, which prompted authorities to halt flights from the airport. Ukraine said on Monday its forces neutralised 161 out of 162 Russian drones launched overnight. As the US deadline for the Russian president to agree to a ceasefire in Ukraine approaches, Mr Trump's Special Envoy Steve Wikoff will be travelling to Moscow on Wednesday for talks. Ukrainian President Volodymyr Zelensky said Sunday that Ukraine and Russia have agreed to exchange 1,200 prisoners following their latest round of negotiations in Istanbul in July. Mr Zelensky also said that his office is in communication with US partners and that \"pressure on Russia can truly work - in a way that makes them feel the consequences of prolonging the war\"."
    },
    {
        "title": "Netanyahu to instruct Israeli military on next steps in Gaza after ceasefire talks collapse",
        "description": "Benjamin Netanyahu has said he will convene his security cabinet to discuss how to instruct Israel's military to proceed in Gaza to meet all of his war goals.",
        "url": "https://news.sky.com/story/netanyahu-to-instruct-israeli-military-on-next-steps-in-gaza-after-ceasefire-talks-collapse-13406943",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gaza-aid_6982910.jpg?20250804182935",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-04 15:44:00",
        "Headline": "Mr Netanyahu is believed to be leaning towards expanding the offensive in Gaza and seizing the entire enclave, according to Israel's Channel 12, which cited an official from his office.",
        "Content": " Benjamin Netanyahu has said he will convene his security cabinet to discuss how to instruct Israel's military to proceed in Gaza to meet all of his war goals. \"We must continue to stand together and fight together to achieve all our war objectives: the defeat of the enemy, the release of our hostages, and the assurance that Gaza will no longer pose a threat to Israel,\" the Israeli prime minister told his cabinet. It came after indirect ceasefire talks with Hamas, which had aimed to agree on a US-backed proposal for a 60-day truce, during which aid would be flown into Gaza and half of the hostages Hamas is holding would be freed in exchange for Palestinian prisoners jailed in Israel, fell apart. Mr Netanyahu is believed to be leaning towards expanding the offensive in Gaza and seizing the entire enclave, according to Israel's Channel 12, which cited an official from his office. He will convene his cabinet on Tuesday to make a decision, Israeli media reported. Former Israeli prime minister Ehud Barak told Sky News chief presenter Mark Austin the war in the last several months has been \"a war of deception\". \"It's nothing to do with the security in Israel, and it has nothing to do with the future of the hostages. It's basically a war to hold together the coalition and to save Netanyahu from the day of reckoning that will come inevitably when the war stops, when these criminal court cases of corruption will be accelerated. Basically, it's totally unjustified.\" A group of around 600 retired Israeli security officials have written to Donald Trump to urge the US president to pressure Israel to bring the war to an immediate end. \"It is our professional judgement that Hamas no longer poses a strategic threat to Israel,\" the letter said. \"Your credibility with the vast majority of Israelis augments your ability to steer Prime Minister [Benjamin] Netanyahu and his government in the right direction: End the war, return the hostages, stop the suffering.\"  Meanwhile, at least 40 Palestinians were killed by Israeli gunfire and airstrikes in Gaza on Monday, including 10 seeking aid, local medics said. Another five died of starvation, they added. Aid groups say Israel's latest measures to allow aid into the besieged enclave are not enough. Read more:Over 100 journalists demand 'immediate and unsupervised' access to Gaza Several hundred Palestinians have been killed by Israeli fire since May as they headed towards food distribution sites and aid convoys, according to witnesses, local health officials and the UN human rights office. Israel's military says it has only fired warning shots and disputes the number killed. Several countries have been airdropping aid to Gaza, though the UN and aid groups warn such drops are costly and dangerous for residents, and deliver less aid than trucks. COGAT, the Israeli military agency that coordinates aid, said during the past week, more than 23,000 tons of humanitarian aid in 1,200 trucks had entered Gaza, but hundreds had yet to be driven to aid distribution hubs by UN and other international organisations. Palestinian and UN officials said Gaza needs around 600 aid trucks to enter each day to meet its humanitarian requirements - the number Israel used to allow in before the war. The war began when Hamas-led militants killed 1,200 people and took 251 hostage in an attack on southern Israel on 7 October 2023. Israel's offensive has since killed more than 60,000 Palestinians, according to the Hamas-backed health ministry, which does not differentiate between civilians and combatants in its count. Israeli officials say 50 hostages remain in Gaza, with only 20 of those believed to still be alive."
    },
    {
        "title": "UK-France migrant returns deal comes into force",
        "description": "Sir Keir Starmer and Emmanuel Macron's migrant deal comes into force today, with detentions set to begin by the end of the week.",
        "url": "https://news.sky.com/story/uk-france-migrant-returns-deal-comes-into-force-13407017",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-migrants-dunkirk-france_6939149.jpg?20250611113643",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-04 17:37:00",
        "Headline": "The pilot agreement, which was announced during Emmanuel Macron's state visit to the UK last month, will see some people who have crossed the Channel sent back to France in exchange for taking some asylum seekers with ties to Britain. ",
        "Content": " Sir Keir Starmer and Emmanuel Macron's migrant deal comes into force today, with detentions set to begin by the end of the week. The \"one in, one out\" pilot scheme - which allows the UK to send some people who have crossed the Channel back to France in exchange for asylum seekers with ties to Britain - was signed last week, and has now been approved by the European Commission. Politics Hub: Follow live updates It comes as 2025 is on course to be a record year for crossings. Approximately 25,436 people have already made the journey this year, according to PA news agency analysis of Home Office figures - 49% higher than at the same point in 2024. The prime minister and the French president hailed the deal as a \"good agreement\" when it was first announced during the latter's visit to the UK last month. The scheme also means that anyone arriving in a small boat can be detained immediately, with space set aside at immigration removal centres in anticipation of their arrival. Sir Keir said the ratification of the treaty will \"send a clear message - if you come here illegally on a small boat you will face being sent back to France\". Ministers have so far declined to say how many people could be returned under the deal, however, there have been reports that under the scheme only 50 people a week will be returned to France. Sky News political correspondent Rob Powell said while it was a \"policy win\" for the government, the numbers must eventually get higher than 50 per week if it is to work as a deterrent. Powell said the aim will be to make asylum seekers believe the \"risk of going back to France is so big that they shouldn't bother parting with their cash and paying smugglers\" to make the crossing. Read more:What is the UK-France migrant returns deal?Clampdown on social media ads for Channel crossings unveiled The Conservatives have branded the agreement a \"surrender deal\" and said it will make \"no difference whatsoever\". Under the terms of the agreement, adults arriving on small boats will face being returned to France if their asylum claim is inadmissible. In exchange, the same number of people will be able to come to the UK on a new legal route, provided they have not attempted a crossing before and subject to stringent documentation and security checks. The pilot scheme is set to run until June 2026, pending a longer-term agreement. Home Secretary Yvette Cooper will face questions on the agreement on Sky News Breakfast this morning."
    },
    {
        "title": "Sudan: Thousands resort to eating animal feed to survive in besieged Al Fashir",
        "description": "Al Fashir is being suffocated to death. ",
        "url": "https://news.sky.com/story/it-is-truly-monstrous-inside-the-besieged-sudanese-city-where-families-are-forced-to-eat-animal-feed-to-live-13406258",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-al-fashir-sudan_6981774.png?20250803150638",
        "type": "World",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-08-04 02:22:00",
        "Headline": "Al Fashir, and its 900,000 inhabitants, have been held hostage by the paramilitary Rapid Support Forces for 14 months. Food and fuel is blocked from entering, and its people are suffering as a result.",
        "Content": "\n          Africa correspondent\n              @YousraElbagir\n  Al Fashir is being suffocated to death.  The paramilitary Rapid Support Forces (RSF) has held the capital of North Darfur hostage in a 14-month siege - blocking food or fuel from entering the locality and forcing starvation on its 900,000 inhabitants. The entire city is currently a militarised zone as Sudan's army and the Darfur Joint Protection Force fend off the RSF from capturing the last state capital in the Darfur region not currently under their control. Rare footage sent to Sky News from inside al Fashir town shows streets emptied of cars and people. The city's remaining residents are hiding from daytime shelling inside their homes, and volunteers move through town on donkey carts distributing the little food they can find. 'It is truly monstrous' Journalist Muammer Ibrahim sent Sky News voice notes from there. \"The situation is monstrous,\" he says. \"It is truly monstrous. \"The markets are emptied of food and partially destroyed by shelling. Civilians were killed at the market, just a day ago. People have fled market areas but there is also shelling in residential areas. Every day, you hear of 10 or 12 civilians killed in attacks.\" His voice sounds shallow, weakened by the dire conditions, and gunshots can be heard in the background. \"The intense fighting has meant that people cannot safely search for anything to eat, but there is also nothing for their money to buy. The markets are depleted. Hundreds of thousands here are threatened by a full-blown famine,\" he says. \"There has been a full blockade of any nutritional supplies arriving in al Fashir since the collapse of Zamzam camp. It closed any routes for produce or supplies to enter.\" The RSF ransacked the famine-ridden Zamzam displacement camp 7.5 miles (12km) south of al Fashir town in April, after the military reclaimed Sudan's capital Khartoum. The United Nations believes that at least 100 people were killed in the attacks, including children and aid workers. The majority of Zamzam's half a million residents fled to other areas for safety. Hundreds of thousands of them are now squeezed into tents on the edges of al Fashir, completely cut off from humanitarian assistance. The capture of the camp allowed the RSF to tighten their siege and block off the last remaining supply route. Aid convoys attempting to enter al Fashir have come under fire by the RSF since last year. \"Already, between June and October 2024, we had several trucks stuck and prevented by the Rapid Support Forces from going to their destination which was al Fashir and Zamzam,\" says Mathilde Simon, project coordinator at Medicins Sans Frontieres. \"They were prevented from doing so because they were taking food to those destinations.\" \"There was another UN convoy that tried to reach al Fashir in the beginning of June. It could not, and five aid workers were killed. \"Since then, no convoy has been able to reach al Fashir. There have been ongoing negotiations to bring in food but they have not been successful until now.\" Families are resorting to eating animal feed to survive. Videos sent to Sky News by volunteers show extreme suffering and deprivation, with sickly children sitting on thin straw mats on the hard ground. Community kitchens are their only source of survival, only able to offer small meals of sorghum porridge to hundreds of thousands of elderly men, women and children facing starvation. The question now is whether famine has fully taken root in al Fashir after the collapse of Zamzam camp and intensified RSF siege. 'Malnutrition rates are catastrophic'  \"The lack of access has prevented us from carrying out further assessment that can help us have a better understanding of the situation, but already in December 2024 famine was confirmed by the IPC Famine Review Committee in five areas,\" says Mathilde. \"It was already confirmed in August 2024 in Zamzam but had spread to other displacement camps including Abu Shouk and it was already projected in al Fashir. \"This was more than eight months ago and we know the situation has completely worsened and malnutrition rates are absolutely catastrophic.\" Treasurer of al Fashir's Emergency Response Rooms, Mohamed al Doma, believes all signs point to a famine. He had to walk for four hours to escape the city with his wife and two young children after living through a full year of the siege and offering support to residents as supplies and funding dwindled. Read more from Sky News:How the drug kush is ruining livesVideos of emaciated Israeli hostage Evyatar David released \"There is a famine of the first degree in al Fashir. All the basic necessities for life are not available,\" he says. \"There is a lack of sustenance, a lack of nutrition and a lack of shelter. The fundamental conditions for human living are not living. There is nothing available in the markets - no food or work. There is no farming for subsistence. There is no aid entering al Fashir.\" \"All of this points towards a full-blown famine.\""
    },
    {
        "title": "Search for British woman who disappeared from Greek beach",
        "description": "A search is under way for a British woman who went missing from a beach in Kavala, northern Greece.",
        "url": "https://news.sky.com/story/search-for-british-woman-who-disappeared-from-greek-beach-13406722",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-michele-ann-joy-bourda_6982537.jpg?20250804113256",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-04 10:08:00",
        "Headline": "The Hellenic Coastguard said the port authority received reports that Michele Ann Joy Bourda, 59, was missing, on the evening of 1 August.",
        "Content": "A search is under way for a British woman who went missing from a beach in Kavala, northern Greece. The Hellenic Coastguard said the port authority received reports that Michele Ann Joy Bourda, 59, was missing on the evening of 1 August. The woman went missing from the Ofrynio beach area. The coastguard is investigating reports that her belongings were left on the beach. On Sunday, three recreational craft, five fishing boats and two patrol boats were involved in the search. According to local media, she lived with her husband, who is reportedly of Greek origin, in the Macedonian city of Serres. She had gone to the beach with him and reportedly vanished while he was sleeping on a sunbed. \n                  Firefighters tackle blazes as wildfires break out in Greece, Turkey and Albania\n                 \n                  'Covert' and 'accelerating campaign' to return Elgin Marbles to Greece, say campaigners\n                 \n                  Wildfires break out in Turkey, Syria and Greece - with towns near Athens evacuated\n                 The charity LifeLine Hellas, which put out an appeal to try and find Ms Bourda, said she went missing at noon on 1 August. She has been described as having straight blonde hair up to her shoulders and being 1.73m tall."
    },
    {
        "title": "Actor Dhanush criticises AI-altered ending for re-release of hit film Raanjhanaa",
        "description": "Indian actor Dhanush says he has been left \"completely disturbed\" by the re-release of one of his hit films with an alternative ending assisted by AI - but the production company behind it has rejected criticism of the move.",
        "url": "https://news.sky.com/story/actor-dhanush-criticises-ai-altered-ending-for-re-release-of-hit-film-raanjhanaa-13406798",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-dhanush-the-gray-man_6982629.jpg?20250804125158",
        "type": "World",
        "Author": "Gemma Peplow",
        "Date Published": "2025-08-04 17:14:00",
        "Headline": "Hindi-language romantic drama Raanjhanaa, called Ambikapathy in its Tamil-language title, was first released in 2013.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Indian actor Dhanush says he has been left \"completely disturbed\" by the re-release of one of his hit films with an alternative ending assisted by AI - but the production company behind it has rejected criticism of the move. Hindi-language romantic drama Raanjhanaa, called Ambikapathy in its Tamil-language title, has made headlines over its re-release 12 years after first hitting cinemas in 2013. Eros Media World says the new version, which sees the film's original ending switched to a happier one, is a \"lawful and creative reinterpretation, not a replacement\", and that the change and use of artificial intelligence has been made clear to viewers. The company says the alternate ending was \"crafted under the direction of a human creative team using AI only as an assistive tool - not as an autonomous content generator\". In a statement sent to Sky News, group chief executive Pradeep Dwivedi said the studio wanted to offer \"fresh dimensions for audiences\" and never intended \"to undermine the original essence\" of the film. However, the AI-assisted re-release has already drawn criticism from the film's director Aanand L Rai, and now its star Dhanush has released a statement to say the \"AI-altered climax\" had left him \"completely disturbed\". \"This alternate ending has stripped the film of its very soul, and the concerned parties went ahead with it despite my clear objection,\" Dhanush said in a message posted on X. \"This is not the film I committed to 12 years ago.\" Dhanush said the use of AI to alter films or other content \"is a deeply concerning precedent for both art and artists\" that \"threatens the integrity of storytelling and the legacy of cinema\". He added: \"I sincerely hope that stricter regulations are put in place to prevent such practices in the future.\" Read more from Sky News:Oasis 'shocked and saddened' after man dies at Wembley gigColdplay's viral kiss cam set to feature in UK showsJewish comedian says she has new venue for Fringe Eros said Dhanush's \"wonderful performance\" in the role of Kundan had brought the character to life \"in an unforgettable way\". However, the studio said the actor's team had been aware of the plans before the re-release and that they had received \"no formal objection\". \"While we acknowledge and respect differing views on the use of AI in film, our aim has been to explore how technology can complement storytelling and offer fresh dimensions for audiences - never to undermine the original essence of a film,\" Mr Dwivedi said. \"The original Raanjhanaa and Ambikapathy remains much loved and widely available, and the IP is fully preserved.\" He added: \"Just as storytelling evolves, so too does music - and with responsible use of AI, even the most iconic soundtracks are being respectfully reimagined as remixes to resonate with new generations while preserving their original soul. \"We deeply respect the creative community and remain committed to collaborating in ways that ensure mutual respect, innovation, and progress for the cinematic arts. As one of India's most storied film studios, Eros remains committed to celebrating Indian cinema, nurturing talent, and embracing technology responsibly.\" Dhanush's comments come after statements posted by Rai, who has described the re-release as \"a betrayal\" to the original that has been \"dressed up as innovation\". Writing on Instagram, he said: \"This was never just a film to us. It was shaped by human hands, human flaws, and human feeling. What's now being circulated is not a tribute. It is a reckless takeover that strips the work of its intent, its context, and its soul.\" Responding to the director's criticism, Mr Dwivedi reiterated that the re-release is \"a respectful creative reinterpretation - clearly labelled and separate from the original version\" and said such practices are \"common in global cinema, and reflect our long-standing commitment to innovation, audience engagement, and cultural preservation\". He also highlighted an ongoing legal dispute between Eros and Colour Yellow Productions, the studio co-founded by Rai. The re-release comes as artificial intelligence continues to cause concern among some in the creative industries. In June, video game actors in the US ended a strike after nearly a year of industrial action over the use of AI by game studios - an issue that was also part of the concerns raised by the Hollywood writers' and actors' strikes in 2023. Earlier this year, Oscar-nominated film The Brutalist made headlines for using the technology to \"refine\" Hungarian accents. It has also been used for de-aging stars such as Harrison Ford for the latest Indiana Jones film and Tom Hanks in the 2024 picture Here - and for helping to create \"the last Beatles record\" featuring John Lennon's vocals, released in 2023. There is a \"good side\" to the technology but also a \"scary side\", Sir Paul McCartney has said, adding: \"We will just have to see where that leads.\""
    },
    {
        "title": "Crocus City Hall attack: Suspected gunmen go on trial in Moscow over concert massacre",
        "description": "Nineteen people have gone on trial under strict security in Moscow, accused of taking part in last year's concert hall massacre in the city that killed 149 people and wounded more than 600.",
        "url": "https://news.sky.com/story/crocus-city-hall-attack-suspected-gunmen-go-on-trial-in-moscow-over-concert-massacre-13406989",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-crocus-city-hall-russia_6982949.jpg?20250804195638",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-04 16:34:00",
        "Headline": "Four gunmen burst into the Crocus City Hall last March and shot dead 149 people who were waiting to hear a rock band before setting the building on fire.",
        "Content": "Nineteen people have gone on trial under strict security in Moscow, accused of taking part in last year's concert hall massacre in the city that killed 149 people and wounded more than 600. Four gunmen burst into the Crocus City Hall on 22 March and fatally shot people who were waiting for a show by a popular rock band before setting the building on fire. A faction of the Islamic State group said it was behind the attack but Russia's President Vladimir Putin and other state officials have claimed, without providing evidence, that Ukraine had a role in the shooting spree, which Kyiv has strongly denied. Russia's top criminal investigation agency said in June that it believed the attack had been \"planned and carried out in the interests of the current leadership of Ukraine in order to destabilise political situation in our country\". The Investigative Committee also noted that the four suspected gunmen tried to escape to Ukraine afterwards. The quartet, all identified as citizens of Tajikistan, were arrested hours after the attack and later appeared in a Moscow court, showing signs of having been severely beaten. Read more on Sky News:Storm Floris latest: UK hit by 124mph windsKremlin urges nuclear cautionHow Euros star juggled studies and training Appearing in court on Monday, the accused kept their heads down as they sat in the defendants' cage. Earlier this year, the committee said six other suspects were charged in absentia and placed on Russia's wanted list for allegedly recruiting and organising the training of the four. Other defendants in the trial were accused of helping them."
    },
    {
        "title": "Denmark zoo asks people to donate unwanted pets as food for its predators",
        "description": "A zoo in Denmark is asking for unwanted pets to be donated - not for further care but as food for its predators.",
        "url": "https://news.sky.com/story/denmark-zoo-asks-people-to-donate-unwanted-pets-as-food-for-its-predators-13406863",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-zoo-lynx_6982768.jpg?20250804150054",
        "type": "World",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-08-04 13:27:00",
        "Headline": "Aalborg zoo explains that if people have animals that need to be removed \"for various reasons\", they can bring a maximum of four small species at once. The animals are euthanised by trained staff and then used as food.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n A zoo in Denmark is asking for unwanted pets to be donated - not for further care but as food for its predators. Aalborg zoo in North Jutland published the unusual appeal on Facebook and its website. The post says they can take smaller live animals such as chickens, rabbits and guinea pigs, which are \"an important part of the diet of our predators - especially the European lynx, which needs whole prey that resembles what it would naturally hunt in the wild.\" It explains that if people have animals that need to be removed \"for various reasons\", they can bring a maximum of four small species at once. The animals are euthanised by trained staff and then used as food. \"In zoos, we have a responsibility to imitate the animals' natural food chain - for the sake of both animal welfare and professional integrity,\" the post continues. \"Nothing goes to waste - and we ensure natural behaviour, nutrition and well-being of our predators.\" The zoo says it will also take horses which are less than 147cm tall and have a pet passport. In a statement, Aalborg zoo said: \"For many years at Aalborg Zoo, we have fed our carnivores with smaller livestock. \"When keeping carnivores, it is necessary to provide them with meat, preferably with fur, bones, etc., to give them as natural a diet as possible. \"Therefore, it makes sense to allow animals that need to be euthanised for various reasons to be of use in this way. \"In Denmark, this practice is common, and many of our guests and partners appreciate the opportunity to contribute.\" It is not unheard of for animals which die in a zoo or are culled from local healthy populations to be fed to predators. In 2014, Copenhagen Zoo caused controversy by euthanising an 18-month-old male giraffe called Marius and feeding his body to the lions. At the time, the zoo said it was due to a duty to avoid inbreeding. An online petition with thousands of signatures failed to save him. In 2023, Leipzig Zoo slaughtered a 15-year-old zebra and fed the carcass to their lions. The director of the site said they had tried to rehome the stallion but hadn't been successful."
    },
    {
        "title": "Itamar Ben-Gvir: Why far-right Israeli minister's visit to Al Aqsa mosque site risks inflaming tensions",
        "description": "Far-right Israeli minister Itamar Ben-Gvir has risked inflaming religious tensions by reportedly praying at the Al Aqsa mosque site in Jerusalem.",
        "url": "https://news.sky.com/story/itamar-ben-gvir-why-far-right-israeli-ministers-visit-to-al-aqsa-mosque-site-risks-inflaming-tensions-13406659",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-israel-gaza-ben-gvir_6982033.jpg?20250803182151",
        "type": "World",
        "Author": "Michael Drummond",
        "Date Published": "2025-08-04 11:56:00",
        "Headline": "The Al Aqsa compound sits atop the Temple Mount in Jerusalem, which is considered holy in Islam, Judaism and Christianity, and has been a flashpoint during the Israel-Hamas war.",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n Far-right Israeli minister Itamar Ben-Gvir has risked inflaming religious tensions by reportedly praying at the Al Aqsa mosque site in Jerusalem. The compound sits atop the Temple Mount, which is considered holy in Islam, Judaism and Christianity, has been a flashpoint during the Israel-Hamas war. In this story, Sky News looks at why the security minister is so inflammatory - and why his actions at Al Aqsa are so controversial. Who is Itamar Ben-Gvir? Viewed as a hardline extremist by many, Itamar Ben-Gvir is a powerful figure in Prime Minister Benjamin Netanyahu's government. Burly, bespectacled and rough-spoken, the 49-year-old appeals to a pro-settler, nationalist-religious constituency behind his Jewish Power party. Mr Ben-Gvir has been convicted eight times for offences that include racism and supporting a terrorist organisation. He was banned from compulsory military service by the army when he was a teen, which deemed his views too extreme.  During the 2022 election campaign, he was photographed brandishing a gun at Palestinian demonstrators in East Jerusalem. In government, Mr Ben-Gvir and fellow hardliner, finance minister Bezalel Smotrich, have repeatedly clashed with Mr Netanyahu and criticised peace efforts. The pair threatened to quit last year - thereby collapsing the governing coalition - if the prime minister agreed to a ceasefire deal before Hamas was destroyed. Mr Ben-Gvir has also called for Israel to conquer all of Gaza. What is the Al Aqsa compound - and why is it so important? Al Aqsa is a compound of Islamic religious buildings on top of the Temple Mount in Jerusalem. Among them is the Dome of the Rock shrine, the oldest surviving work of Islamic architecture, with a distinctive golden dome structure that looks out over the city. The compound is the third holiest site in Islam and the most sacred site in Judaism. Under a delicate decades-old \"status quo\" arrangement with Muslim authorities, the site is administered by a Jordanian religious foundation, and Jews can visit but may not pray there. Suggestions that Israel could alter the rules at the compound have sparked outrage in the Muslim world before and ignited violence in the past. There were no immediate reports of violence on Sunday. Read more:Hamas 'ready' to receive aid for Israeli hostagesNew US plan for Gaza starting to emerge What happened when Itamar Ben-Gvir visited Al Aqsa? Mr Ben-Gvir visited the site on Sunday and reportedly prayed there - challenging the rules. Videos released by a small Jewish organisation called the Temple Mount Administration showed him leading a group walking in the compound. Other videos circulating online appeared to show him praying. The Waqf, the foundation that administers the complex, said Mr Ben-Gvir was among 1,250 who ascended the site and who it said prayed, danced and shouted. In a statement on social media alongside a video appearing to show him outside the Dome of the Rock, he reiterated his call for Israel to occupy all of Gaza and declare sovereignty. \"Only in this way will we return the kidnapped and win the war,\" he wrote. A spokesperson for Palestinian President Mahmoud Abbas condemned Mr Ben-Gvir's visit, which he said \"crossed all red lines\". \"The international community, specifically the US administration, is required to intervene immediately to put an end to the crimes of the settlers and the provocations of the extreme right-wing government in Al Aqsa mosque, stop the war on the Gaza Strip and bring in humanitarian aid,\" Nabil Abu Rudeineh said in a statement. Mr Netanyahu said after Mr Ben-Gvir's visit that Israel's policy of maintaining the status quo at the compound \"has not changed and will not change\"."
    },
    {
        "title": "Donald Trump wades into Sydney Sweeney ad debate",
        "description": "Donald Trump has waded into the debate surrounding Sydney Sweeney's jeans ad.",
        "url": "https://news.sky.com/story/donald-trump-wades-into-sydney-sweeney-ad-debate-13407019",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sydney-sweeney-advert_6982943.jpg?20250804195137",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-04 17:51:00",
        "Headline": "The ad featuring the 27-year-old actress has the tagline \"Sydney Sweeney has great jeans\" and sparked a debate in the US over race and Western beauty standards.",
        "Content": " Donald Trump has waded into the debate surrounding Sydney Sweeney's jeans ad. The American Eagle ad, which features the 27-year-old actress, who starred in the HBO series Euphoria and White Lotus, has the tagline \"Sydney Sweeney has great jeans\". It has sparked a debate in the US over race and Western beauty standards. In a Truth Social post, the US president described it as the \"hottest ad out there\". Hailing Sweeney as a \"registered Republican\", he said the jeans are \"flying off the shelves\", adding: \"Go get 'em Sydney!\" Most of the criticism of the ad has centred on videos using the word \"genes\" instead of \"jeans\", with one in which Sweeney says: \"Genes are passed down from parents to offspring, often determining traits like hair colour, personality and even eye colour. My jeans are blue.\" Critics argued the play on words potentially promotes eugenics, a discredited theory that believed humanity could be improved through the selective breeding of certain traits. But others have defended the ad, saying the critics are reading too much into its message. The video appeared on American Eagle's Facebook page and other social media channels, but is not part of the ad campaign. In a statement on Instagram on Friday, American Eagle Outfitters said the campaign \"is and always was about the jeans. Her jeans. Her story. We'll continue to celebrate how everyone wears their AE jeans with confidence, their way. Great jeans look good on everyone.\" Stocks in American Eagle Outfitters jumped by 23.3% after Mr Trump's intervention. Read more from Sky News:Kremlin urges caution in nuclear rhetoric following Trump's submarine orderStill wanted: UK riots suspects pictured in new police appeal US correspondent They say all publicity is good publicity, and Sydney Sweeney's American Eagle ad is certainly notching up the column inches, especially now Donald Trump has intervened. The US president must have been breathlessly excited when he found out Sweeney was a registered Republican because he wrote a Truth Social post in support of her before deleting it twice and reposting three times to correct various spelling and grammatical errors. He clearly could not wait to get involved in the discourse. \"Sydney Sweeney, a registered Republican, has the HOTTEST ad out there,” he wrote. \"Go get 'em Sydney!\" In any other era, the president weighing in so heavily on one side of a pop culture issue would've been unusual. But the current president knows people are talking about the ad around their dinner tables and at parties right now. By injecting himself into the discussion, they will now be talking about him too.  In his Truth Social post, which he reposted three times to fix various typos, Mr Trump compared the ad with \"woke\" ones \"on the other side of the ledger\" - as he criticised other companies, as well as hitting out at Taylor Swift. \"The tide has seriously turned - Being WOKE is for losers, being Republican is what you want to be,\" he wrote. Sky News has contacted Sweeney's agent for comment."
    },
    {
        "title": "Soulja Boy arrested on suspected weapons charge during traffic stop",
        "description": "Soulja Boy has been arrested and charged with possession of a firearm during a traffic stop.",
        "url": "https://news.sky.com/story/soulja-boy-arrested-on-suspected-weapons-charge-during-traffic-stop-13406608",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-soulja-boy-rapper_6982302.jpg?20250804042515",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-04 03:02:00",
        "Headline": "The rapper, whose real name is DeAndre Cortez Way, was a passenger in the car that was stopped in Los Angeles at 2.35am on Sunday.",
        "Content": "Soulja Boy has been arrested and charged with possession of a firearm during a traffic stop. The rapper, whose real name is DeAndre Cortez Way, was a passenger in the car that was stopped in the Fairfax area of Los Angeles early on Sunday morning, the LAPD said. \"A passenger was detained and police arrested DeAndre Cortez Way for being a convicted felon in possession of a firearm,\" the statement added. Possessing a firearm as a convicted felon is a felony. The 35-year-old was booked into jail in the LAPD's Wilshire Division shortly after 6am. It is not clear if he has since been released. Police did not provide information on what prompted the traffic stop and who else was in the vehicle with Way. Soulja Boy is yet to publicly comment on the incident. \n                  Donald Trump wades into Sydney Sweeney ad debate\n                 \n                  Actor Dhanush criticises AI-altered ending for re-release of hit film Raanjhanaa\n                 \n                  Oasis 'shocked and saddened' after man dies at Wembley Stadium concert  \n                 Read more US news:Man tries to detonate 14 IEDs while being arrestedTrump orders two nuclear subs closer to Russia Soulja Boy is best known for his 2007 hit Crank That, which topped the Billboard Hot 100 for seven weeks and landed him a nomination for best rap song at the Grammys. The rapper was arrested and charged with a felony in 2014 for carrying a loaded gun during a traffic stop in LA. In April this year, the Chicago hip-hop artist was ordered to pay more than $4m (£3m) in damages to his former assistant after being found liable for sexually assault, as well as physically and emotionally abusing them."
    },
    {
        "title": "Tesla approves $29bn share award to Elon Musk",
        "description": "Tesla's board has signed off a $29bn (&#163;21.8bn) share award to Elon Musk after a court blocked an earlier package worth almost double that sum.",
        "url": "https://news.sky.com/story/tesla-approves-29bn-share-award-to-elon-musk-13406793",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-elon-musk-tesla_6982741.jpg?20250804142519",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-08-04 11:36:00",
        "Headline": "The company says the package hopes to \"incentivize Elon to remain at Tesla\" given his various outside interests.",
        "Content": "Tesla's board has signed off a $29bn (£21.8bn) share award to Elon Musk after a court blocked an earlier package worth almost double that sum. The new award, which amounts to 96 million new shares, is not just about keeping the electric vehicle (EV) firm's founder in the driving seat as chief executive. The new stock will also bolster his voting power from a current level of 13%. Money latest: Ryanair check-in change this autumn He and other shareholders have long argued that boosting his interest in the company is key to maintaining his focus after a foray into the trappings of political power at Donald Trump's side - a relationship that has now turned sour. Musk is angry at the president's tax cut and spending plans, known as the big beautiful bill. Tesla has also suffered a sales backlash as a result of Musk's past association with Mr Trump and role in cutting federal government spending. The company is currently focused on the roll out of a new cheaper model in a bid to boost flagging sales and challenge steep competition, particularly from China. \n                  Donald Trump wades into Sydney Sweeney ad debate\n                 \n                  India hints it will keep buying Russian oil - despite Trump threats\n                 \n                  Trump orders two nuclear subs to be moved closer to Russia\n                 The headwinds have been made stronger as the Trump administration has cut support for EVs, with Musk admitting last month that it could lead to a \"few rough quarters\" for the company. Read more: Tesla faces losing billions after Musk-Trump fallout  Tesla is currently running trials of its self-driving software and revenues are not set to reflect the anticipated rollout until late next year. Musk had been in line for a share award worth over $50bn back in 2018 - the biggest compensation package ever seen globally. But the board's decision was voided by a judge in Delaware following a protracted legal fight. There is still a continuing appeal process. Earlier this year, Tesla said its board had formed a special committee to consider some compensation matters involving Musk, without disclosing details. The special committee said in the filing on Monday: \"While we recognize Elon's business ventures, interests and other potential demands on his time and attention are extensive and wide-ranging... we are confident that this award will incentivize Elon to remain at Tesla\". It added that if the Delaware courts fully reinstate the 2018 \"performance award\", the new interim grant would either be forfeited or offset to ensure no \"double dip\". The new compensation package is subject to shareholder approval."
    },
    {
        "title": "Motor finance operators can breathe big sigh of relief",
        "description": "Bank stocks have enjoyed a boost as traders digest the Supreme Court's ruling on the car finance scandal.",
        "url": "https://news.sky.com/story/motor-finance-operators-can-breathe-big-sigh-of-relief-13406677",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-money-car-gfx-auto_6965902.png?20250716091559",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-08-04 08:44:00",
        "Headline": "Stock market movements on Monday show that a much worse consumer compensation bill had been firmly in investors' sights.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Bank stocks have enjoyed a boost as traders digest the Supreme Court's ruling on the car finance scandal. Some of the country's most exposed lenders, including Lloyds and Close Brothers, saw their share prices jump by 7.55% and 21.62% respectively. It came after the court delivered a reprieve from a possible £44bn compensation bill. Money latest: Ryanair check-in change this autumn Banks will still most likely have to fork out over discretionary commissions - a type of commission for dealers that was linked to how high an interest rate they could get from customers. The FCA, which banned the practice in 2021, is currently consulting on a redress scheme but the final bill is unlikely to exceed £18bn. Overall, the result has been better than expected for the banks.  Lloyds, which owns the country's largest car finance provider Black Horse, had set aside £1.2bn to cover compensation payouts. Following the judgment, the bank said it \"currently believes that if there is any change to the provision, it is unlikely to be material in the context of the group\".  The judgment released some of the anxiety that has been weighing over the Bank's share price. Jonathan Pierce, banking analyst at Jefferies, said the FCA's prediction was \"consistent with our estimates, and most importantly, we think it largely de-risks Lloyds' shares from the 'motor issue'\". Read more:Martin Lewis explains compensation qualificationHow to tell if you've been mis-sold Bank stocks have responded robustly to each twist and turn in this tale, sinking after the Court of Appeal turned against them and jumping (as much as 8% in the case of Close Brothers) when the Supreme Court allowed the appeal hearing. Concerns about this volatility motivated the Supreme Court to deliver its judgment late in the afternoon so that traders would have time to absorb the news."
    },
    {
        "title": "Asda closes in on £400m property deal with investment giant Blue Owl",
        "description": "Asda is in talks about a &#163;400m deal to offload some of its supermarket real estate assets to a giant investment house as it looks to plough more funding into its turnaround plans.",
        "url": "https://news.sky.com/story/asda-closes-in-on-163400m-property-deal-with-investment-giant-blue-owl-13406783",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-money-blog-asda-asda-express_6445512.jpg?20240205172134",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-04 11:28:00",
        "Headline": "The supermarket chain is in advanced talks with the New York-listed investor to sell and lease back roughly 20 supermarkets in a deal that will boost funding for its recovery plans, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Asda is in talks about a £400m deal to offload some of its supermarket real estate assets to a giant investment house as it looks to plough more funding into its turnaround plans. Sky News has learnt that Blue Owl Capital, the New York-listed asset management group, has emerged as the frontrunner to buy roughly 20 Asda stores and lease them back to the Leeds-based retailer. A deal could be formally agreed within weeks, according to people close to the situation. Money latest: Ryanair check-in change this autumn Last year, TDR acquired Zuber Issa's stake in the chain, and now owns 67.5% of its shares. Allan Leighton's plans include competing more aggressively with mainstream and discount rivals on price, improving availability and streamlining costs more effectively. The company has undertaken sale-and-leaseback deals on previous occasions, notably in 2023 when it struck a £650m deal with US-based Realty Inc. \n                  Tesla approves $29bn share award to Elon Musk\n                 \n                  Money blog: Pensioners who earn over £35,000 told to act to avoid 'tax headache'\n                 \n                  Motor finance operators can breathe big sigh of relief\n                 An Asda spokesman declined to comment on the talks with Blue Owl Capital but said: \"Sale-and-leaseback [transactions] have been a feature of the retail industry for many years. \"While maintaining a strong freehold base remains central to Asda's property strategy, we will consider suitable opportunities to unlock value from our property portfolio as part of our material programme of investment into the business.\" Eastdil, the real estate investment bank which was appointed to run the process several months ago, and Blue Owl have been contacted for comment."
    },
    {
        "title": "Mis-sold car loans - did it happen to me?",
        "description": " <a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/mis-sold-car-loans-did-it-happen-to-me-13406851",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-car-finance-podcast_6982770.jpg?20250804150524",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-08-04 13:12:00",
        "Headline": "No subtitle found",
        "Content": " 👉 Listen to Sky News Daily on your podcast app 👈 If you bought a car as far back as 2007 with a loan organised through your car dealership, you could be eligible for a payout. The regulator, the Financial Conduct Authority, is consulting on a compensation scheme - and it's thought up to 40% of motorists who entered personal contract purchase (PCP) or hire purchase agreements between 2007 and 2021 will be eligible for a payout. Niall Paterson talks to Sky's business correspondent Gurpreet Narwan about who might be eligible. He also speaks to Adrian Dally, director of motor finance at the Finance and Leasing Association, who argues the payout levels look too high at this stage. Producer: Emily HulmeEditor: Wendy Parker"
    },
    {
        "title": "UK-France migrant returns deal comes into force",
        "description": "Sir Keir Starmer and Emmanuel Macron's migrant deal comes into force today, with detentions set to begin by the end of the week.",
        "url": "https://news.sky.com/story/uk-france-migrant-returns-deal-comes-into-force-13407017",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-migrants-dunkirk-france_6939149.jpg?20250611113643",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-04 17:37:00",
        "Headline": "The pilot agreement, which was announced during Emmanuel Macron's state visit to the UK last month, will see some people who have crossed the Channel sent back to France in exchange for taking some asylum seekers with ties to Britain. ",
        "Content": " Sir Keir Starmer and Emmanuel Macron's migrant deal comes into force today, with detentions set to begin by the end of the week. The \"one in, one out\" pilot scheme - which allows the UK to send some people who have crossed the Channel back to France in exchange for asylum seekers with ties to Britain - was signed last week, and has now been approved by the European Commission. Politics Hub: Follow live updates It comes as 2025 is on course to be a record year for crossings. Approximately 25,436 people have already made the journey this year, according to PA news agency analysis of Home Office figures - 49% higher than at the same point in 2024. The prime minister and the French president hailed the deal as a \"good agreement\" when it was first announced during the latter's visit to the UK last month. The scheme also means that anyone arriving in a small boat can be detained immediately, with space set aside at immigration removal centres in anticipation of their arrival. Sir Keir said the ratification of the treaty will \"send a clear message - if you come here illegally on a small boat you will face being sent back to France\". Ministers have so far declined to say how many people could be returned under the deal, however, there have been reports that under the scheme only 50 people a week will be returned to France. Sky News political correspondent Rob Powell said while it was a \"policy win\" for the government, the numbers must eventually get higher than 50 per week if it is to work as a deterrent. Powell said the aim will be to make asylum seekers believe the \"risk of going back to France is so big that they shouldn't bother parting with their cash and paying smugglers\" to make the crossing. Read more:What is the UK-France migrant returns deal?Clampdown on social media ads for Channel crossings unveiled The Conservatives have branded the agreement a \"surrender deal\" and said it will make \"no difference whatsoever\". Under the terms of the agreement, adults arriving on small boats will face being returned to France if their asylum claim is inadmissible. In exchange, the same number of people will be able to come to the UK on a new legal route, provided they have not attempted a crossing before and subject to stringent documentation and security checks. The pilot scheme is set to run until June 2026, pending a longer-term agreement. Home Secretary Yvette Cooper will face questions on the agreement on Sky News Breakfast this morning."
    },
    {
        "title": "No 10 decline to say if Palestine will be recognised with Hamas in power",
        "description": "The prime minister's spokesman has refused eight times to confirm whether recognition of Palestine could go ahead if Hamas remain&#160;in power and the hostages are not released.&#160;",
        "url": "https://news.sky.com/story/no-10-decline-to-say-if-palestine-will-be-recognised-with-hamas-in-power-13406850",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-keir-starmer-donald-trump_6976134.jpg?20250728150023",
        "type": "Politics",
        "Author": "Tamara Cohen",
        "Date Published": "2025-08-04 13:08:00",
        "Headline": "Sir Keir Starmer has said the UK would only refrain from recognising Palestine if Israel allows more aid into Gaza, stops annexing land in the West Bank, agrees to a ceasefire and signs up to a long-term peace process over the next two months.",
        "Content": "\n          Political correspondent\n              @tamcohen\n The prime minister's spokesman has refused eight times to confirm whether recognition of Palestine could go ahead if Hamas remain in power and the hostages are not released.  Keir Starmer's spokesman was questioned by journalists for the first time since the announcement last week that the UK will formally recognise the state in September - unless Israel meets certain conditions including abiding by a ceasefire and increasing aid. The policy has been criticised by the families of UK hostages, campaigners and some Labour MPs, who argue it would reward Hamas and say it should be conditional on the release of the remaining hostages. A senior Hamas politician, Ghazi Hamad, speaking to Al Jazeera, said at the weekend that major nations' decision to recognise a Palestinian state \"is one of the fruits of 7 October\". Gaza latest: Trump pressed to recognise Palestinian state The PM's spokesman said on Monday: \"The PM is clear that on 7 October, Hamas committed the worst act of terror in Israel's history. That horror has continued since then. \"As the foreign secretary said over the weekend, Hamas are rightly pariahs who can have no role in Gaza's future, there is a diplomatic consensus on that. Hamas must immediately release all hostages and have no role in the governance of Gaza.\" But asked whether removing Hamas from power and releasing hostages were conditions for statehood, he said a decision on recognition would be made at the UN General Assembly meeting in September, based on \"an assessment of how far the parties have met the steps we have set out. No one side will have veto on recognition through their actions or inactions.\"  He added: \"Our focus is on the immediate situation on the ground, getting more aid in to end the suffering in Gaza and supporting a ceasefire and a long-term peace for Israelis and Palestinians based a two-state solution.\" Starmer, who recalled his cabinet for an emergency meeting last week before setting out the new position, is following the lead of French president Emmanuel Macron, who first pledged to move toward recognising Palestinian statehood in April. Read more:New US plan for Gaza starting to emergeHamas responds to disarmament reports Canada has also backed recognition if conditions are met, including by the Palestinian Authority. The prime minister had previously said he would recognise a state of Palestine as part of a contribution to a peace process.  In his announcement last Tuesday, he said: \"We need to see at least 500 trucks entering Gaza every day. But ultimately, the only way to bring this humanitarian crisis to an end is through a long-term settlement. \"So we are supporting the US, Egyptian and Qatari efforts to secure a vital ceasefire. That ceasefire must be sustainable and it must lead to a wider peace plan, which we are developing with our international partners. \"I've always said we will recognise a Palestinian state as a contribution to a proper peace process, at the moment of maximum impact for the two-state solution. With that solution now under threat, this is the moment to act.\" Adam Rose, a lawyer acting for British families of hostages in Gaza, has said: \"Why would Hamas agree to a ceasefire if it knew that to do so would make British recognition of Palestine less likely?\""
    },
    {
        "title": "Nigel Farage dared me to walk in London after 9pm: Here's my response",
        "description": "At a press conference on Monday in which Reform UK announced the Tory police and crime commissioner for Leicestershire and Rutland was joining their ranks, as well as former prison governor Vanessa Frake, I asked Nigel Farage a simple question.",
        "url": "https://news.sky.com/story/nigel-farage-dared-me-to-walk-in-london-after-9pm-heres-my-response-13406872",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-nigel-farage-reform_6982606.jpg?20250804123628",
        "type": "Politics",
        "Author": "Mhari Aurora",
        "Date Published": "2025-08-04 13:44:00",
        "Headline": "Nigel Farage is tapping into voters' emotions - their feelings that the country is broken. ",
        "Content": "\n          Political correspondent\n              @MhariAurora\n  At a press conference on Monday in which Reform UK announced the Tory police and crime commissioner for Leicestershire and Rutland was joining their ranks, as well as former prison governor Vanessa Frake, I asked Nigel Farage a simple question. But his answer wasn't what I expected. I asked the Reform UK leader if the six-week campaign on law and order, with the tagline \"Britain is Lawless\", was in fact project fear scaring people into voting for his party. He utterly rejected that claim and responded to me saying: \"No, they are afraid. They are afraid. I dare you, I dare you to walk through the West End of London after 9 o'clock of an evening wearing jewellery. You wouldn't do it. You know that I'm right. You wouldn't do it.\" I am not afraid to walk in the West End of London after 9pm wearing jewellery. I have done it many times before and will continue to do so… but perhaps that is because I do not own a Rolex. However, just because Farage is wrong on that point, doesn't mean he isn't tapping into other legitimate fears across the country. \n                  Cabinet minister reiterates colleague's claim Nigel Farage is on side of Jimmy Savile\n                 \n                  Minister 'weaponising' Savile will make Labour MPs queasy - but there's a bigger risk\n                 \n                  Nigel Farage demands apology over 'disgusting' Jimmy Savile comparison\n                 Snatch theft does worry me, hence why I now have a phone case with a strap attached to it that I can put around my body. And I worry about knife crime in my area and what the impact could be if I were to have children - on the weekend someone was stabbed to death a stone's throw from my house.  However, if we look at the statistics, it is invariably a more nuanced picture than Farage or social media might have us believe. According to police reports, thefts from a person in London are almost five times the national average, and they've been going up since the pandemic. And the Office for National Statistics (ONS) also notes that thefts outside of the home, eg phone snatching, has increased. However, possession of weapons has fallen in London by 29% over the last three years. And according to the ONS, crime in England and Wales is 30% lower than in 2015, and 76% lower than 1995. And it is a similar picture for violent crime. In short, am I right to be more worried that snatch theft and knife crime in London is increasing? Yes, and no. But Nigel Farage is tapping into voters' emotions - their feelings that the country is broken. It's a picture the Conservative Party helped to create and the Labour Party happily painted to great effect during the general election campaign of 2024. And the more politicians of all colours tell voters that \"the system is broken\", the more voters might start to believe them. That is what Nigel Farage is banking on."
    },
    {
        "title": "Will Starmer's Trump tactics keep paying off?",
        "description": "<a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics at Sam and Anne's on your podcast app👈</a>&#8239;&#8239;",
        "url": "https://news.sky.com/story/will-starmers-trump-tactics-keep-paying-off-13405128",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-politics-at-sam-and-annes_6856408.png?20250623145702",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-04 04:57:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to Politics at Sam and Anne's on your podcast app👈   Sir Keir Starmer is a prime minister who is arguably more comfortable abroad - and has spent his first year in office putting Britain front and centre on the world stage.  So, in this episode, Sam and Anne are joined by Politico's editor-in-chief John Harris to discuss the major international issues facing the government in the coming parliament. With trade deals and ongoing conflicts across the globe dominating the agenda, the trio ask: • Is the UK living in Trumpland?• How will relationships abroad impact Britain's role in the world?• And does Starmer have the political strength to put pen-to-paper on some upcoming deals with the EU? Sam and Anne are getting a lie-in over summer recess, but they'll be in your feed with special episodes every Monday, before normal service resumes on 1 September."
    },
    {
        "title": "Deputy First Minister Kate Forbes to stand down as MSP in 2026",
        "description": "Scotland's Deputy First Minister Kate Forbes has announced she will stand down at next year's Holyrood election.",
        "url": "https://news.sky.com/story/deputy-first-minister-kate-forbes-to-stand-down-as-msp-in-2026-13406689",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-kate-forbes-snp_6982481.jpg?20250804102346",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-08-04 10:50:00",
        "Headline": "The Skye, Lochaber and Badenoch MSP said she did not \"wish to seek re-election and miss any more of the precious early years of family life\".",
        "Content": "\n          Scotland reporter\n              @Jenster13\n Scotland's Deputy First Minister Kate Forbes has announced she will stand down at next year's Holyrood election. In a letter to First Minister John Swinney, the Skye, Lochaber and Badenoch MSP said she did not \"wish to seek re-election and miss any more of the precious early years of family life\". Ms Forbes is expected to remain in her role until the Scottish parliament election, scheduled for May 2026. Mr Swinney paid tribute to his SNP colleague for her \"invaluable contribution to public life over the last 10 years\". Ms Forbes said it had been an \"incredible privilege\" to serve those in the Highlands since 2016. She wrote: \"I am in no doubt about the scale of my duties as a local representative, an activist and campaigner, and a government minister. \"Quite rightly, this job entails long days far from home, constant attention and total dedication. \n                  Scotland's First Minister John Swinney defends new guidance on tackling pupil behaviour\n                 \n                  Scottish Labour win by-election in Hamilton, Larkhall and Stonehouse as SNP suffer shock defeat\n                 \n                  Hamilton, Larkhall and Stonehouse by-election: Polls close and count begins to replace late MSP\n                 \"As I consider the upcoming election and the prospects of another term, I have concluded that I do not wish to seek re-election and miss any more of the precious early years of family life.\" Ms Forbes said she remains \"wholly supportive\" of Mr Swinney and will continue to serve her constituents and the public \"with diligence\". She added: \"I look forward to campaigning for the SNP at the next election, to return you as first minister for another term and lead Scotland to independence.\" Ms Forbes first entered Holyrood in 2016 following a stint working for her predecessor, Dave Thompson. A Cambridge-educated accountant, the newly-minted MSP found herself in ministerial office by the summer of 2018. She was thrust into the spotlight in 2020 when then finance secretary Derek Mackay resigned in disgrace after messages he had sent to a 16-year-old boy were published by the Scottish Sun on the eve of the Scottish budget. With just hours to prepare, Ms Forbes was forced to step in and deliver the budget, drawing plaudits from across the chamber, before she was eventually promoted into the role herself. While Ms Forbes was on maternity leave and caring for her daughter Naomi in 2023, Nicola Sturgeon announced she was stepping down as first minister and SNP leader. That leadership contest was bruising for the SNP as candidates Ms Forbes, Humza Yousaf and Ash Regan traded blows during lively televised debates. Ms Forbes faced backlash during her campaign after admitting she would have voted against gay marriage in Scotland when it was made legal more than a decade ago. The Free Church of Scotland member also told Sky News that having children out of marriage was \"wrong\" and something she would \"seek to avoid\". However, the MSP stressed that \"in a free society you can do what you want\". Read more from Sky News:Inside Jeremy Corbyn's new partyClampdown on ads for Channel crossings unveiled Although her views on social issues were deemed unpopular with some of her MSP colleagues, she was one of the few SNP ministers who did not delete her WhatsApp messages during the COVID pandemic. Although Ms Forbes lost out to Mr Yousaf in the competition to replace Ms Sturgeon, she would go on to become deputy first minister when he later stepped down and Mr Swinney took charge. She is also the cabinet secretary for economy and Gaelic. Responding to Ms Forbes' letter on Monday, Mr Swinney said: \"I pay tribute to Kate for her invaluable contribution to public life over the last 10 years. \"The challenges of frontline politics are considerable, and I understand the decision she has made although I wish it was not the case. \"I am pleased that Kate will continue to serve in my government and to make a significant contribution to the work of the Scottish National Party. \"I wish her and her family well and for every happiness for the future.\" In recent months, several SNP MSPs have announced plans to stand down next year. The long list includes former first ministers Ms Sturgeon and Mr Yousaf, Rural Affairs Secretary Mairi Gougeon, Finance Secretary Shona Robison, Transport Secretary Fiona Hyslop, and shamed former health secretary Michael Matheson."
    },
    {
        "title": "Permission granted for first-of-its-kind British rocket launch",
        "description": "Permission for the first vertical space launch from UK soil by a British rocket company has been granted by the air safety regulator.",
        "url": "https://news.sky.com/story/permission-granted-for-first-of-its-kind-british-rocket-launch-13407089",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-skyrora-rocket_6983035.jpg?20250805005431",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2025-08-04 23:24:00",
        "Headline": "Although the newly-granted licence allows up to 16 launches a year, the Shetland's spaceport isn't expected to be able to facilitate a launch until early 2026.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n Permission for the first vertical space launch from UK soil by a British rocket company has been granted by the air safety regulator. The licence from the Civil Aviation Authority (CAA) gives Glasgow-based Skyrora the green light to launch its Skylark L rocket from the SaxaVord Spaceport in the Shetland Islands. \"Skyrora is proud to be leading efforts that enable launch activity from the UK, and we look forward to achieving a reliable commercial launch programme that benefits us all,\" said Volodymyr Levykin, CEO of Skyrora. \"It is essential that the UK has sovereign launch capabilities.\" While it's a step towards that goal, the licence doesn't mean the Shetlands will rival America's Cape Canaveral any time soon. Although the CAA licence allows Skyrora up to 16 launches a year, SaxaVord isn't expected to be able to facilitate a launch until early 2026. The current licence is also limited to sub-orbital launches of the 11m tall rocket. Skyrora expects its rocket to reach an altitude of between 120 and 130km - well over the 100km-high \"Karman Line\", which is the internationally-agreed boundary of space. But Skylark L lacks the heft to access low-earth orbit, the ultimate goal for the emerging \"micro launch\" industry. 'Important milestone' Like many of its competitors, Skyrora is using this smaller rocket to test various technologies - and the regulatory environment - before attempting an orbital flight with its larger vehicle, Skyrora-XL. Launching from northern latitudes like the UK offers easier access to satellites in polar or sun-synchronous orbits. Smaller rockets potentially mean cheaper and faster launches, offering a \"responsive\" launch capability to service or support the increasing number of satellites in orbit. \"I am thrilled we've reached this important milestone in the UK space sector, and I congratulate Skyrora for being the first UK company to receive a rocket launch licence,\" said aviation and space minister Mike Kane. The UK, however, has been criticised for being slow to develop a domestic space capability since the Space Industry Act made it possible back in 2018. The first licence for a UK space launch wasn't granted until 2022, but the attempt by Richard Branson's Virgin Galactic for a horizontal rocket launch from an aircraft failed. Read more on Sky News:Hunt for smugglers fuelling meth explosionSky reporter returns to scene of riots confrontation Another licence was granted earlier this year to German micro-launch company RFA but an explosion during testing of their rocket at SaxaVord delayed its plans for a suborbital launch this year. Modifications being made to the SaxaVord spaceport mean it may not be ready to accommodate a launch until 2026. Skyrora told Sky News that if there are significant delays to its plans to launch from SaxaVord, it may look into transferring its CAA licence to Australia's regulator. If so, it expects it could launch SkylarkL from Australia's Woomera test range before the end of 2025. No doubt that would be a disappointment for the UK government and thousands of space enthusiasts in the UK, but it would see history repeat itself. The first (and last) British-built rocket to put a satellite into orbit, Black Arrow, launched from Woomera in 1971."
    },
    {
        "title": "'David and Goliath battle' as talks begin over deal to reduce plastic pollution",
        "description": "The scientist who first raised the alarm over microplastics in the world's oceans has warned of a \"David vs Goliath\" battle between scientists and the plastics industry - as delegates begin to negotiate a global deal to reduce plastic pollution.",
        "url": "https://news.sky.com/story/david-and-goliath-battle-as-talks-begin-over-deal-to-reduce-plastic-pollution-13406792",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-moore-thompson_6982670.jpg?20250804133230",
        "type": "Technology",
        "Author": "Thomas Moore, science correspondent, and Shahryar Iravani, science producer",
        "Date Published": "2025-08-04 11:39:00",
        "Headline": "The UK is among the countries arguing in favour of a deal to massively reduce plastic pollution - but there are powerful nations and industry players standing in its way.",
        "Content": "By Thomas Moore, science correspondent, and Shahryar Iravani, science producer   The scientist who first raised the alarm over microplastics in the world's oceans has warned of a \"David vs Goliath\" battle between scientists and the plastics industry - as delegates begin to negotiate a global deal to reduce plastic pollution. As United Nations talks begin this week, Professor Richard Thompson, head of the International Marine Litter unit at Plymouth University, said: \"We're seeing some coercion and some pressure being put by some of those that have got conflicts of interest that fear they stand to lose from the treaty progress.\" Representatives of 175 countries will meet in Switzerland today, for what should be a final round of negotiations over a legally binding treaty to reduce plastic pollution. The United Nations says while some countries are taking action on plastic, pollution is a global problem that needs a global agreement - but there is no official scientific presence at the talks. Professor Thompson, who is attending the negotiations, said: \"We're only there as observers with a limited capacity to speak, whereas those from the industry have got a massive vested interest. They're funded to be there. And it's a bit of a David and Goliath battle.\" He continued: \"It concerns me that I see some nations that are taking an increasingly short-sighted view, a view that's perhaps driven by political cycles or short-run profits. \"You know, we need those leaders of countries, those negotiators, to take the long-term view to protect our planet for future generations.\" More than 430 million tonnes of plastic is produced each year. But according to environmental charity WWF, around 11 million tonnes end up in the ocean each year as pollution. And that's expected to rise to 29 million tonnes a year by 2040. There is wide consensus among countries that plastic pollution is a problem, but they are split over what to do about it. The UK and more than 70 other nations that are part of a \"High Ambition Coalition\" want production and consumption of plastic reduced to sustainable levels. But major oil producing nations and the chemical industry oppose any cuts. The previous round of talks, in South Korea last year, collapsed in disagreement. Professor Thompson is a founding member of the Scientists' Coalition for an Effective Plastics Treaty. 'Strong treaty' still possible He said previous negotiations have been swamped by lobbyists from the chemicals industry putting pressure on delegates - and that if a good agreement cannot be achieved, leading countries should look to work outside the United Nations framework. Professor Thompson said: \"Given that there are more than 100 nations that are already backing the level of ambition that's required, I think it could be possible to take this out of the UN process, to have a strong treaty that will function to end plastic pollution, to start with those 100 or 120 or so countries and to add others over time. \"I think there'll be a realisation for those that aren't on board initially, that if they don't join forces with that coalition of the willing, they're going to suffer in terms of their own international trade and that it's better to be part of that strong treaty than not to be.\" Plastic is so widely used because it's cheap, durable and can take many forms. So production of new plastic will only fall if better use can be made of the material that already exists. The company Project Plan B is working with the charity The Salvation Army to recycle polyester textiles. They've installed the first machine of its kind to turn the material into plastic pellets that can be used to make yarn for new clothes. Read more from Sky News:Government invests £63m in 'sustainable' jet fuelRevealed: How much rubbish found on UK beaches 'Terrible waste' Just a handful of the pellets is enough to make a T-shirt. Tim Cross, the director of Project Plan B, said the aim is to make the recycling process a closed loop, so as little as possible escapes as waste or pollution. \"This makes much better use of that plastic,\" he said. \"If we're wasting it and losing it into the environment, that's a terrible waste, and we mustn't allow that to happen.\" The UK produces around 700,000 tonnes of textile waste each year. Almost all is landfilled or incinerated. A major problem is that most clothes are made of mixed materials, which makes it uneconomical to recycle them. A polyester shirt may have nylon buttons and cotton thread. But Project Plan B has been working with school uniform maker David Luke on a blazer made completely out of polyester and 100% recyclable. \"These garments normally last on children's backs for a couple of years and used as goalposts a few times. And then what?\" said Mr Cross. \"We wanted to make sure that we can fully recycle the blazer through the system that we've got here, so we had to completely redesign it. \"This is groundbreaking, changing the way that clothing can be made. \"When you've got something that is recycled and recyclable, you've got an instant solution.\""
    },
    {
        "title": "Tesla approves $29bn share award to Elon Musk",
        "description": "Tesla's board has signed off a $29bn (&#163;21.8bn) share award to Elon Musk after a court blocked an earlier package worth almost double that sum.",
        "url": "https://news.sky.com/story/tesla-approves-29bn-share-award-to-elon-musk-13406793",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-elon-musk-tesla_6982741.jpg?20250804142519",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-04 11:36:00",
        "Headline": "The company says the package hopes to \"incentivize Elon to remain at Tesla\" given his various outside interests.",
        "Content": "Tesla's board has signed off a $29bn (£21.8bn) share award to Elon Musk after a court blocked an earlier package worth almost double that sum. The new award, which amounts to 96 million new shares, is not just about keeping the electric vehicle (EV) firm's founder in the driving seat as chief executive. The new stock will also bolster his voting power from a current level of 13%. Money latest: Ryanair check-in change this autumn He and other shareholders have long argued that boosting his interest in the company is key to maintaining his focus after a foray into the trappings of political power at Donald Trump's side - a relationship that has now turned sour. Musk is angry at the president's tax cut and spending plans, known as the big beautiful bill. Tesla has also suffered a sales backlash as a result of Musk's past association with Mr Trump and role in cutting federal government spending. The company is currently focused on the roll out of a new cheaper model in a bid to boost flagging sales and challenge steep competition, particularly from China. \n                  Donald Trump wades into Sydney Sweeney ad debate\n                 \n                  India hints it will keep buying Russian oil - despite Trump threats\n                 \n                  Trump orders two nuclear subs to be moved closer to Russia\n                 The headwinds have been made stronger as the Trump administration has cut support for EVs, with Musk admitting last month that it could lead to a \"few rough quarters\" for the company. Read more: Tesla faces losing billions after Musk-Trump fallout  Tesla is currently running trials of its self-driving software and revenues are not set to reflect the anticipated rollout until late next year. Musk had been in line for a share award worth over $50bn back in 2018 - the biggest compensation package ever seen globally. But the board's decision was voided by a judge in Delaware following a protracted legal fight. There is still a continuing appeal process. Earlier this year, Tesla said its board had formed a special committee to consider some compensation matters involving Musk, without disclosing details. The special committee said in the filing on Monday: \"While we recognize Elon's business ventures, interests and other potential demands on his time and attention are extensive and wide-ranging... we are confident that this award will incentivize Elon to remain at Tesla\". It added that if the Delaware courts fully reinstate the 2018 \"performance award\", the new interim grant would either be forfeited or offset to ensure no \"double dip\". The new compensation package is subject to shareholder approval."
    },
    {
        "title": "Actor Dhanush criticises AI-altered ending for re-release of hit film Raanjhanaa",
        "description": "Indian actor Dhanush says he has been left \"completely disturbed\" by the re-release of one of his hit films with an alternative ending assisted by AI - but the production company behind it has rejected criticism of the move.",
        "url": "https://news.sky.com/story/actor-dhanush-criticises-ai-altered-ending-for-re-release-of-hit-film-raanjhanaa-13406798",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-dhanush-the-gray-man_6982629.jpg?20250804125158",
        "type": "Technology",
        "Author": "Gemma Peplow",
        "Date Published": "2025-08-04 17:14:00",
        "Headline": "Hindi-language romantic drama Raanjhanaa, called Ambikapathy in its Tamil-language title, was first released in 2013.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Indian actor Dhanush says he has been left \"completely disturbed\" by the re-release of one of his hit films with an alternative ending assisted by AI - but the production company behind it has rejected criticism of the move. Hindi-language romantic drama Raanjhanaa, called Ambikapathy in its Tamil-language title, has made headlines over its re-release 12 years after first hitting cinemas in 2013. Eros Media World says the new version, which sees the film's original ending switched to a happier one, is a \"lawful and creative reinterpretation, not a replacement\", and that the change and use of artificial intelligence has been made clear to viewers. The company says the alternate ending was \"crafted under the direction of a human creative team using AI only as an assistive tool - not as an autonomous content generator\". In a statement sent to Sky News, group chief executive Pradeep Dwivedi said the studio wanted to offer \"fresh dimensions for audiences\" and never intended \"to undermine the original essence\" of the film. However, the AI-assisted re-release has already drawn criticism from the film's director Aanand L Rai, and now its star Dhanush has released a statement to say the \"AI-altered climax\" had left him \"completely disturbed\". \"This alternate ending has stripped the film of its very soul, and the concerned parties went ahead with it despite my clear objection,\" Dhanush said in a message posted on X. \"This is not the film I committed to 12 years ago.\" Dhanush said the use of AI to alter films or other content \"is a deeply concerning precedent for both art and artists\" that \"threatens the integrity of storytelling and the legacy of cinema\". He added: \"I sincerely hope that stricter regulations are put in place to prevent such practices in the future.\" Read more from Sky News:Oasis 'shocked and saddened' after man dies at Wembley gigColdplay's viral kiss cam set to feature in UK showsJewish comedian says she has new venue for Fringe Eros said Dhanush's \"wonderful performance\" in the role of Kundan had brought the character to life \"in an unforgettable way\". However, the studio said the actor's team had been aware of the plans before the re-release and that they had received \"no formal objection\". \"While we acknowledge and respect differing views on the use of AI in film, our aim has been to explore how technology can complement storytelling and offer fresh dimensions for audiences - never to undermine the original essence of a film,\" Mr Dwivedi said. \"The original Raanjhanaa and Ambikapathy remains much loved and widely available, and the IP is fully preserved.\" He added: \"Just as storytelling evolves, so too does music - and with responsible use of AI, even the most iconic soundtracks are being respectfully reimagined as remixes to resonate with new generations while preserving their original soul. \"We deeply respect the creative community and remain committed to collaborating in ways that ensure mutual respect, innovation, and progress for the cinematic arts. As one of India's most storied film studios, Eros remains committed to celebrating Indian cinema, nurturing talent, and embracing technology responsibly.\" Dhanush's comments come after statements posted by Rai, who has described the re-release as \"a betrayal\" to the original that has been \"dressed up as innovation\". Writing on Instagram, he said: \"This was never just a film to us. It was shaped by human hands, human flaws, and human feeling. What's now being circulated is not a tribute. It is a reckless takeover that strips the work of its intent, its context, and its soul.\" Responding to the director's criticism, Mr Dwivedi reiterated that the re-release is \"a respectful creative reinterpretation - clearly labelled and separate from the original version\" and said such practices are \"common in global cinema, and reflect our long-standing commitment to innovation, audience engagement, and cultural preservation\". He also highlighted an ongoing legal dispute between Eros and Colour Yellow Productions, the studio co-founded by Rai. The re-release comes as artificial intelligence continues to cause concern among some in the creative industries. In June, video game actors in the US ended a strike after nearly a year of industrial action over the use of AI by game studios - an issue that was also part of the concerns raised by the Hollywood writers' and actors' strikes in 2023. Earlier this year, Oscar-nominated film The Brutalist made headlines for using the technology to \"refine\" Hungarian accents. It has also been used for de-aging stars such as Harrison Ford for the latest Indiana Jones film and Tom Hanks in the 2024 picture Here - and for helping to create \"the last Beatles record\" featuring John Lennon's vocals, released in 2023. There is a \"good side\" to the technology but also a \"scary side\", Sir Paul McCartney has said, adding: \"We will just have to see where that leads.\""
    },
    {
        "title": "'World-first' gonorrhoea vaccine rolled out from today, with UK infections hitting a record high ",
        "description": "The NHS will start rolling out a \"world-first\" vaccination programme against gonorrhoea in England today.",
        "url": "https://news.sky.com/story/world-first-gonorrhoea-vaccine-rolled-out-from-today-with-uk-infections-hitting-a-record-high-13406350",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-not-real-injection_6704924.jpg?20241022170122",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-04 04:04:00",
        "Headline": "Gonorrhoea diagnoses reached 85,000 in 2023, the highest since records began in 1918 and three times more than in 2012.",
        "Content": "The NHS will start rolling out a \"world-first\" vaccination programme against gonorrhoea in England today. Earlier this year, NHS England announced that eligible patients would start to be offered the vaccine from early August amid a record number of gonorrhoea cases and increasingly antibiotic-resistant strains. Now, the Department of Health and Social Care (DHSC) has said sexual health clinics will be able to offer a free vaccine against the sexually transmitted infection from today. Ashley Dalton, minister for public health and prevention, said in a statement that the rollout \"represents a major breakthrough in preventing an infection that has reached record levels\". She added: \"This government's world-first vaccination programme will help turn the tide on infections, as well as tackling head-on the growing threat of antibiotic resistance. \"I strongly encourage anyone who is eligible to come forward for vaccination, to protect not only yourselves but also your sexual partners.\" Gonorrhoea diagnoses reached 85,000 in 2023 - the highest since records began in 1918 and three times more than in 2012. \n                  NHS figures reveal impact of five-day resident doctors' strike\n                 \n                  Why aren’t parents getting their children vaccinated?\n                 \n                  BMA hits back at claims it refused to allow doctors to work in critical areas during strike\n                 Gonorrhoea is the second most common bacterial STI in the UK, according to NHS England and is passed on through sex. Not everyone gets symptoms, but they can include a burning pain when you urinate, fluid or discharge coming out of your genitals and pain in your testicles or lower abdomen in women. It can also affect other parts of the body, including the throat and eyes. Read more on the symptoms of the disease here. Jabs will be offered for free to those at highest risk from the bacteria, including gay and bisexual men who have a recent history of multiple sexual partners and a bacterial STI in the previous 12 months. The vaccine is based on an existing vaccine, 4CMenB, used to protect against meningococcal B disease. However, it is between 32.7% to 42% effective against gonorrhoea, which means it will not completely eliminate the potential to get the disease. The DHSC referenced analysis led by Imperial College London which said the vaccination could prevent up to 100,000 cases of gonorrhoea and save the NHS more than £7.9m over the next decade. Read more from Sky News:Two Strictly Come Dancing stars accused of taking cocaineChild vaccination rates lowest in more than a decade - why?Fresh arrest after aircraft vandalised at RAF base Dr Sema Mandal, consultant epidemiologist at the UK Health Security Agency, added that the vaccine \"will give much needed protection to those that need it most - making the UK a world leader in the fight against gonorrhoea\". \"It's excellent to see that at the same time other important vaccines will continue to be offered in sexual health services to those eligible,\" she added. \"Sexually transmitted infections aren't just an inconvenience - they can have a major impact on your health and your sexual partners, so if offered I strongly urge you to get these jabs, you'll be protecting yourself as well as others. \"Don't put it off and regret it later.\" At the appointment for the gonorrhoea vaccine, patients will also be offered jabs for mpox, human papillomavirus (HPV), and hepatitis A and B."
    },
    {
        "title": "Donald Trump wades into Sydney Sweeney ad debate",
        "description": "Donald Trump has waded into the debate surrounding Sydney Sweeney's jeans ad.",
        "url": "https://news.sky.com/story/donald-trump-wades-into-sydney-sweeney-ad-debate-13407019",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sydney-sweeney-advert_6982943.jpg?20250804195137",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-04 17:51:00",
        "Headline": "The ad featuring the 27-year-old actress has the tagline \"Sydney Sweeney has great jeans\" and sparked a debate in the US over race and Western beauty standards.",
        "Content": " Donald Trump has waded into the debate surrounding Sydney Sweeney's jeans ad. The American Eagle ad, which features the 27-year-old actress, who starred in the HBO series Euphoria and White Lotus, has the tagline \"Sydney Sweeney has great jeans\". It has sparked a debate in the US over race and Western beauty standards. In a Truth Social post, the US president described it as the \"hottest ad out there\". Hailing Sweeney as a \"registered Republican\", he said the jeans are \"flying off the shelves\", adding: \"Go get 'em Sydney!\" Most of the criticism of the ad has centred on videos using the word \"genes\" instead of \"jeans\", with one in which Sweeney says: \"Genes are passed down from parents to offspring, often determining traits like hair colour, personality and even eye colour. My jeans are blue.\" Critics argued the play on words potentially promotes eugenics, a discredited theory that believed humanity could be improved through the selective breeding of certain traits. But others have defended the ad, saying the critics are reading too much into its message. The video appeared on American Eagle's Facebook page and other social media channels, but is not part of the ad campaign. In a statement on Instagram on Friday, American Eagle Outfitters said the campaign \"is and always was about the jeans. Her jeans. Her story. We'll continue to celebrate how everyone wears their AE jeans with confidence, their way. Great jeans look good on everyone.\" Stocks in American Eagle Outfitters jumped by 23.3% after Mr Trump's intervention. Read more from Sky News:Kremlin urges caution in nuclear rhetoric following Trump's submarine orderStill wanted: UK riots suspects pictured in new police appeal US correspondent They say all publicity is good publicity, and Sydney Sweeney's American Eagle ad is certainly notching up the column inches, especially now Donald Trump has intervened. The US president must have been breathlessly excited when he found out Sweeney was a registered Republican because he wrote a Truth Social post in support of her before deleting it twice and reposting three times to correct various spelling and grammatical errors. He clearly could not wait to get involved in the discourse. \"Sydney Sweeney, a registered Republican, has the HOTTEST ad out there,” he wrote. \"Go get 'em Sydney!\" In any other era, the president weighing in so heavily on one side of a pop culture issue would've been unusual. But the current president knows people are talking about the ad around their dinner tables and at parties right now. By injecting himself into the discussion, they will now be talking about him too.  In his Truth Social post, which he reposted three times to fix various typos, Mr Trump compared the ad with \"woke\" ones \"on the other side of the ledger\" - as he criticised other companies, as well as hitting out at Taylor Swift. \"The tide has seriously turned - Being WOKE is for losers, being Republican is what you want to be,\" he wrote. Sky News has contacted Sweeney's agent for comment."
    },
    {
        "title": "Actor Dhanush criticises AI-altered ending for re-release of hit film Raanjhanaa",
        "description": "Indian actor Dhanush says he has been left \"completely disturbed\" by the re-release of one of his hit films with an alternative ending assisted by AI - but the production company behind it has rejected criticism of the move.",
        "url": "https://news.sky.com/story/actor-dhanush-criticises-ai-altered-ending-for-re-release-of-hit-film-raanjhanaa-13406798",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-dhanush-the-gray-man_6982629.jpg?20250804125158",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-08-04 17:14:00",
        "Headline": "Hindi-language romantic drama Raanjhanaa, called Ambikapathy in its Tamil-language title, was first released in 2013.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Indian actor Dhanush says he has been left \"completely disturbed\" by the re-release of one of his hit films with an alternative ending assisted by AI - but the production company behind it has rejected criticism of the move. Hindi-language romantic drama Raanjhanaa, called Ambikapathy in its Tamil-language title, has made headlines over its re-release 12 years after first hitting cinemas in 2013. Eros Media World says the new version, which sees the film's original ending switched to a happier one, is a \"lawful and creative reinterpretation, not a replacement\", and that the change and use of artificial intelligence has been made clear to viewers. The company says the alternate ending was \"crafted under the direction of a human creative team using AI only as an assistive tool - not as an autonomous content generator\". In a statement sent to Sky News, group chief executive Pradeep Dwivedi said the studio wanted to offer \"fresh dimensions for audiences\" and never intended \"to undermine the original essence\" of the film. However, the AI-assisted re-release has already drawn criticism from the film's director Aanand L Rai, and now its star Dhanush has released a statement to say the \"AI-altered climax\" had left him \"completely disturbed\". \"This alternate ending has stripped the film of its very soul, and the concerned parties went ahead with it despite my clear objection,\" Dhanush said in a message posted on X. \"This is not the film I committed to 12 years ago.\" Dhanush said the use of AI to alter films or other content \"is a deeply concerning precedent for both art and artists\" that \"threatens the integrity of storytelling and the legacy of cinema\". He added: \"I sincerely hope that stricter regulations are put in place to prevent such practices in the future.\" Read more from Sky News:Oasis 'shocked and saddened' after man dies at Wembley gigColdplay's viral kiss cam set to feature in UK showsJewish comedian says she has new venue for Fringe Eros said Dhanush's \"wonderful performance\" in the role of Kundan had brought the character to life \"in an unforgettable way\". However, the studio said the actor's team had been aware of the plans before the re-release and that they had received \"no formal objection\". \"While we acknowledge and respect differing views on the use of AI in film, our aim has been to explore how technology can complement storytelling and offer fresh dimensions for audiences - never to undermine the original essence of a film,\" Mr Dwivedi said. \"The original Raanjhanaa and Ambikapathy remains much loved and widely available, and the IP is fully preserved.\" He added: \"Just as storytelling evolves, so too does music - and with responsible use of AI, even the most iconic soundtracks are being respectfully reimagined as remixes to resonate with new generations while preserving their original soul. \"We deeply respect the creative community and remain committed to collaborating in ways that ensure mutual respect, innovation, and progress for the cinematic arts. As one of India's most storied film studios, Eros remains committed to celebrating Indian cinema, nurturing talent, and embracing technology responsibly.\" Dhanush's comments come after statements posted by Rai, who has described the re-release as \"a betrayal\" to the original that has been \"dressed up as innovation\". Writing on Instagram, he said: \"This was never just a film to us. It was shaped by human hands, human flaws, and human feeling. What's now being circulated is not a tribute. It is a reckless takeover that strips the work of its intent, its context, and its soul.\" Responding to the director's criticism, Mr Dwivedi reiterated that the re-release is \"a respectful creative reinterpretation - clearly labelled and separate from the original version\" and said such practices are \"common in global cinema, and reflect our long-standing commitment to innovation, audience engagement, and cultural preservation\". He also highlighted an ongoing legal dispute between Eros and Colour Yellow Productions, the studio co-founded by Rai. The re-release comes as artificial intelligence continues to cause concern among some in the creative industries. In June, video game actors in the US ended a strike after nearly a year of industrial action over the use of AI by game studios - an issue that was also part of the concerns raised by the Hollywood writers' and actors' strikes in 2023. Earlier this year, Oscar-nominated film The Brutalist made headlines for using the technology to \"refine\" Hungarian accents. It has also been used for de-aging stars such as Harrison Ford for the latest Indiana Jones film and Tom Hanks in the 2024 picture Here - and for helping to create \"the last Beatles record\" featuring John Lennon's vocals, released in 2023. There is a \"good side\" to the technology but also a \"scary side\", Sir Paul McCartney has said, adding: \"We will just have to see where that leads.\""
    },
    {
        "title": "Jewish comedian Rachel Creeger says she has new venue for Edinburgh Fringe show",
        "description": "A Jewish comedian who says her original comedy slot at Edinburgh Fringe was cancelled by the venue has told Sky News she will now be able to perform at the event after being offered new locations.",
        "url": "https://news.sky.com/story/jewish-comedian-rachel-creeger-says-she-has-new-venue-for-edinburgh-fringe-show-13406678",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rachel-creeger-comedian_6979558.jpg?20250801080652",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-08-04 08:46:00",
        "Headline": "Rachel Creeger says she will now perform her show Ultimate Jewish Mother at two venues throughout her run at the Edinburgh Fringe.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n A Jewish comedian who says her original comedy slot at Edinburgh Fringe was cancelled by the venue has told Sky News she will now be able to perform at the event after being offered new locations. Rachel Creeger: Ultimate Jewish Mother will take place across two different venues in the city - The Big Tent at Hoots @ Nicolson Square Gardens, and Dirty Martini at Le Monde. Last month, Creeger said her original venue, Whistle Binkies, called her and fellow Jewish comedian Philip Simon to cancel their slots. In a new statement announcing the move, she said it would be \"a few days before the street marketing\" in Edinburgh \"can be amended or new flyers arrive so please do spread the word and let people know of the new time and location\". She also thanked the new venues for allowing the show to retain \"unticketed status\", which allows \"those who cannot afford to pay to see the show for free, and those who are able to pay to donate what they can afford\". The comedian added: \"I would also like to extend my thanks and appreciation to everyone who has reached out over the past couple of weeks with support and offers of help. You have kept my heart warm through an otherwise dark and cold time.\" As Britain's only touring comedian who is also a practising Orthodox Jew, Creeger says she and other Jewish comedians have experienced a significant increase in antisemitism while performing over the past two years. She says her show is in no way political. \"We're not the people making the trouble,\" she told Sky News last week. \"I've never caused harm anywhere; my show doesn't do that, my show is lovely.\" Read more from Sky News:Why Oasis reunion is 'catastrophic' for Fringe performersColdplay's viral kiss cam set to feature in UK shows Creeger said she was given three reasons for her original slot being cancelled: concerns raised by staff to the venue about safety, graffiti following previous performances, and a \"vigil for IDF soldiers\" she says the venue initially claimed had been held during her performance last year. She said the venue later had to admit this vigil had not taken place and that she did not see evidence of graffiti herself last year. \"We're not the ones writing it... but if it was bothering them and they worried it was bothering us, then maybe we'd have volunteered to help them - or to help clean it,\" she said. Responding to the apparent safety concerns, she said: \"It's a pub in Edinburgh, it's a music venue, they themselves have bouncers most evenings... And perhaps they might say if there's a concern about extra risk, we should do all we can to make our performers safe.\" The Fringe Society, which organises the comedy festival, has said its role is to provide support and advice to all participants \"with a vision to give anyone a stage and everyone a seat\". A spokesperson explained they do not manage or programme venues and \"we understand that the show cancellations have been a choice made by the venue\". Whistle Binkies has not responded to multiple requests by Sky News for comment. Police Scotland told Sky News last week that it had not \"received any reports of concern\" about Creeger's show."
    },
    {
        "title": "Soulja Boy arrested on suspected weapons charge during traffic stop",
        "description": "Soulja Boy has been arrested and charged with possession of a firearm during a traffic stop.",
        "url": "https://news.sky.com/story/soulja-boy-arrested-on-suspected-weapons-charge-during-traffic-stop-13406608",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-soulja-boy-rapper_6982302.jpg?20250804042515",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-04 03:02:00",
        "Headline": "The rapper, whose real name is DeAndre Cortez Way, was a passenger in the car that was stopped in Los Angeles at 2.35am on Sunday.",
        "Content": "Soulja Boy has been arrested and charged with possession of a firearm during a traffic stop. The rapper, whose real name is DeAndre Cortez Way, was a passenger in the car that was stopped in the Fairfax area of Los Angeles early on Sunday morning, the LAPD said. \"A passenger was detained and police arrested DeAndre Cortez Way for being a convicted felon in possession of a firearm,\" the statement added. Possessing a firearm as a convicted felon is a felony. The 35-year-old was booked into jail in the LAPD's Wilshire Division shortly after 6am. It is not clear if he has since been released. Police did not provide information on what prompted the traffic stop and who else was in the vehicle with Way. Soulja Boy is yet to publicly comment on the incident. \n                  Donald Trump wades into Sydney Sweeney ad debate\n                 \n                  Actor Dhanush criticises AI-altered ending for re-release of hit film Raanjhanaa\n                 \n                  Oasis 'shocked and saddened' after man dies at Wembley Stadium concert  \n                 Read more US news:Man tries to detonate 14 IEDs while being arrestedTrump orders two nuclear subs closer to Russia Soulja Boy is best known for his 2007 hit Crank That, which topped the Billboard Hot 100 for seven weeks and landed him a nomination for best rap song at the Grammys. The rapper was arrested and charged with a felony in 2014 for carrying a loaded gun during a traffic stop in LA. In April this year, the Chicago hip-hop artist was ordered to pay more than $4m (£3m) in damages to his former assistant after being found liable for sexually assault, as well as physically and emotionally abusing them."
    }
]